{
    "I Wanna Be the Madam!": {
        "author": "Tae San",
        "artist": "Tae San",
        "description": "Failed college entrance exams leave Heera feeling hopeless. That is, until she submits her \"appeal\" to a theater troupe at a folk village, catching the attention of the troupe's leader and changing her path forever. Now, Heera strives not to go to college, but to become the troupe's madam!",
        "slug": "1222",
        "cover": "https://static.manta.net/2021-12-01/sy/syOsW2raHYhbAoBG.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T02:02:06.653Z"
    },
    "Day by Day": {
        "author": "Gaedarae",
        "artist": "Gaedarae",
        "description": "Hosu and Yeoul are childhood best friends. But they have a fallout when Hosu confesses out of the blue and Yeoul doesn’t reciprocate his feelings. Months later, they are surprised to find that they’re not only going to be in the same high school, but in the same class?! A sweet high school romance about the fine line between friends and lovers. ",
        "slug": "1179",
        "cover": "https://static.manta.net/2021-04-01/1Z/1ZHKSIutl17j6ZqN.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-01-24T15:28:15.453Z"
    },
    "On A Leash": {
        "author": "Aji",
        "artist": "Aji",
        "description": "An all-out race war among shapeshifters has begun. Fiercely loyal and brave, Red is the perfect soldier. However, she is also outspoken and stubborn, causing her to butt heads with her senior commanding officers. Between fighting battles and trying to keep out of trouble, will Red ever find peace?",
        "slug": "1812",
        "cover": "https://static.manta.net/2022-06-10/5d/5dfAUV6dGzR10gqi.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T09:06:47.705Z"
    },
    "Heart Stain": {
        "author": "AG",
        "artist": "AG",
        "description": "Woohyun has a secret crush on his homeroom teacher. His best friend, Doha, finds out and confesses his feelings for him. But then he makes an interesting proposition: \"Go out with me. Fall for me before graduation, and I win. If you don't, you win.\" Can Woohyun like someone other than his teacher?",
        "slug": "1248",
        "cover": "https://static.manta.net/2022-02-18/Bm/Bm12fJiKNBjVGizY.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:26:12.280Z"
    },
    "A Good Day to Go Crazy": {
        "author": "yusa",
        "artist": "yusa",
        "description": "Hosoo's uneventful days are spent caring for his sick sister until Esau, a dazzling singer facing a personal crisis, enters his life. Behind Esau's stardom is a world of untold pain, and Hosoo is the only one he finds comfort in. From that day on, Hosoo's life is anything but ordinary.",
        "slug": "1301",
        "cover": "https://static.manta.net/2021-03-03/jS/jSZ6MRKdBj5f8axg.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:53.562Z"
    },
    "Today's a New Day": {
        "author": "Chaeun Han",
        "artist": "Chaeun Han",
        "description": "100-year-old writer Jinhee was ready to leave her life behind. But in a world of new technology and higher life expectancies, that’s no longer the case. Together with her robot caretaker M.U. and her upbeat neighbor Baegun, can Jinhee rediscover the simple joys that make life worth living?",
        "slug": "1407",
        "cover": "https://static.manta.net/2021-06-29/Os/OsACF1wUUqy6tFQU.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-01-25T10:09:04.626Z"
    },
    "A Matter of Time": {
        "author": "Ha Yangji",
        "artist": "Ha Yangji",
        "description": "When her mom gets a new boyfriend, 19-year-old Soohyun decides to move out. In a stroke of luck, her college classmate Yujin offers for her to move in for free, no strings attached. But Yujin has a hidden motive... Will her secret affect their dynamic as roommates?",
        "slug": "1689",
        "cover": "https://static.manta.net/2022-01-20/eF/eF9CUsTQYA3ilH4F.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T05:34:52.044Z"
    },
    "Shape of the Future": {
        "author": "DAMA",
        "artist": "DAMA",
        "description": "Estranged daughter Som discovers a mysterious box in her mother's closet after she falls ill and is hospitalized. Upon accidentally opening the box, Som meets a strange woman who introduces herself as a grim reaper. Just who is this mysterious woman and what is her connection to Som's mother?",
        "slug": "1776",
        "cover": "https://static.manta.net/2022-04-22/JJ/JJL8GfyB22enF3uV.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-04T07:56:21.462Z"
    },
    "Wake Up, Warrior": {
        "author": "Gunwoo Gunzo",
        "artist": "Ananas",
        "description": "A hybrid: half animal, half human. Kakana, the hybrid herbalist-in-hiding awakes to find five poisoned and lost adventurers who ask for her help. In a world where non-hybrids want the extinction of her kind, she must decide whether to take on the adventure to save them or to continue to stay hidden.",
        "slug": "1156",
        "cover": "https://static.manta.net/2022-02-18/Oa/OaGAKqEPjrotIfG9.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-01T03:10:38.201Z"
    },
    "Season of Change": {
        "author": "AJS",
        "artist": "AJS",
        "description": "Ohran Lim is an ex-boxer who never managed to go pro. Now, she spends her days working at the local convenience store, wondering where it all went wrong. But after she meets young couple Woon and Baram, she slowly begins to change her outlook on life.\n\"I need to find what makes me happy.\"",
        "slug": "1225",
        "cover": "https://static.manta.net/2021-10-15/kJ/kJN7GQKQDRBP0Byj.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:26:04.403Z"
    },
    "I Raised a Black Dragon": {
        "author": "Sottan",
        "artist": "Sottan",
        "description": "After dying from overwork, Noa ends up possessing the body of Eleanora, the villainess from a novel. Noa simply wants to lead a peaceful life and tries not to interfere with the original story. That is, until a baby dragon that’s meant to imprint on the heroine imprints on her instead...",
        "slug": "1768",
        "cover": "https://static.manta.net/2022-02-18/C3/C3ImhlaHbe9iDOxj.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-10T03:49:56.137Z"
    },
    "I Lived in a Shelter": {
        "author": "Haram",
        "artist": "Haram",
        "description": "Haram is running away from home for the third time. After struggling with life in a dormitory, she's decided to stay at a shelter for homeless adolescents. Haram is worried about living with others while managing her depression and trauma... but she's determined to find happiness.",
        "slug": "1231",
        "cover": "https://static.manta.net/2021-12-01/UZ/UZMwnceGVWPzqRxB.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-31T03:34:13.947Z"
    },
    "Starfall": {
        "author": "LAPIN",
        "artist": "LEYA",
        "description": "The boy, though born to a king, chose a path the whole world condemned. The girl, due to forces out of her control, was a pariah from the moment she was born. The stars align for this unlikely pair as their destinies entwine, and they form a bond that stands the test of time.",
        "slug": "1386",
        "cover": "https://static.manta.net/2022-05-24/vJ/vJR9hjh2UxqwkbQn.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-21T06:56:11.602Z"
    },
    "Shadow Beauty": {
        "author": "Ahum",
        "artist": "Ahum",
        "description": "Because of her looks, Yaejin is bullied at school and even insulted by strangers. But after school, she leads a secret life: with heavy makeup and hours of photo editing, she lives as Genie, a social media star with 770K followers. While Yaejin is toeing the line between her true self and Genie, what will happen when a boy from school discovers her secret? ",
        "slug": "1168",
        "cover": "https://static.manta.net/2021-12-16/PG/PG4TQJ2XzdUg3YvH.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-03-17T07:02:54.428Z"
    },
    "Lady Beast": {
        "author": "Swan",
        "artist": "NOW",
        "description": "To escape her miserable life, the quiet Princess Elisa agrees to an arranged marriage with the war tyrant, Duke Ginger of Randell Kingdom. However, an evil curse suddenly causes them to switch bodies! Can these two opposites learn to understand each other and maybe even find love?",
        "slug": "1681",
        "cover": "https://static.manta.net/2021-11-08/sS/sSVCYNC2FEsXEtdj.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T08:36:16.810Z"
    },
    "My OG Fan": {
        "author": "Areum",
        "artist": "Areum",
        "description": "Hanul has always been Sanso's biggest supporter. But as Sanso gets closer to his dream of becoming a singer, they begin to drift apart. Four years later, Hanul has a boyfriend, and Sanso is in a popular idol group. Somehow, fate brings them together again. Will they share how they really feel this time?",
        "slug": "1395",
        "cover": "https://static.manta.net/2022-01-19/nn/nnUcYEdovjwglEJy.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-27T00:57:44.340Z"
    },
    "Paljae, Child of Winter": {
        "author": "Gabaemari",
        "artist": "Gabaemari",
        "description": "Young Paljae drifts to the isle at world's end to be taken in by Munryeong, a hermit with a mysterious past. But when Paljae begins to waste away in the sun-bathed climate, Munryeong takes his little companion on a journey to the cold north that uncovers their forgotten past encounter.",
        "slug": "1775",
        "cover": "https://static.manta.net/2022-05-12/ju/juS9vSoMvFfz0zg0.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T01:01:20.149Z"
    },
    "Pumpkin Time": {
        "author": "Gaedarae",
        "artist": "Gaedarae",
        "description": "Taeju and Haewon were best friends growing up. One day, Taeju moves to the United States. Years go by without any contact, until Taeju suddenly comes back to Korea in search of his best friend. But what happens when his male best friend is now a high school … girl?!",
        "slug": "1182",
        "cover": "https://static.manta.net/2021-01-28/DN/DNU1aOwC2rUvqBAB.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T05:32:44.282Z"
    },
    "Nine": {
        "author": "Lee Eumsae",
        "artist": "HANA",
        "description": "After discovering a mystery incense stick, Sela finds out that she can travel back in time by lighting the incense stick. With her new ability, Sela saves her mother and thinks she's finally found her happy ending. However, she realizes that her time-traveling ability comes with a price when she finds out that her first love Yijoon is now dating her best friend...",
        "slug": "1245",
        "cover": "https://static.manta.net/2021-11-30/Il/IlDwIQT3vN0K5Gj0.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T02:04:01.484Z"
    },
    "Mejaz Regulus in the World": {
        "author": "Sasa Dongman",
        "artist": "Sasa Dongman",
        "description": "A marriage alliance between two great demon-slaying families brings Mo Yan and Xuanyuan Yu together. Though Yan intended to divorce Yu after two years, he soon discovers she has come to occupy a place in his heart. Will they be able to stay together amid endless conflict and hidden truths?",
        "slug": "1417",
        "cover": "https://static.manta.net/2021-12-01/zn/zn7hTCR2XRumuZ3b.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-25T08:08:14.518Z"
    },
    "A Small Lie": {
        "author": "Sulmi Bak",
        "artist": "Kwonsam",
        "description": "Older brother Yuchan excels in his studies. Younger brother Yujae shows no interest in school. Their mother Jiwon is relieved when Yujae starts opening up to his tutor, Mira. But one day, Jiwon receives a shocking letter from Mira: \"I write to you regarding my murder of your son.\"",
        "slug": "1230",
        "cover": "https://static.manta.net/2021-11-26/ut/utqnQjLlVNBwyT6j.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T14:28:42.876Z"
    },
    "Joan the Alien": {
        "author": "Hyoin Kim",
        "artist": "Yunana",
        "description": "With a smothering, toxic gray sky, life on earth is no longer the same. Io has been wearing a Purity Suit for 28 years, until he discovers that it had been defective his whole life. With only a couple of years left to live, he meets Joan, and his life starts to go in a new direction.",
        "slug": "1186",
        "cover": "https://static.manta.net/2020-12-10/R0/R0OrvCaFo58tKCdi.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T14:32:29.136Z"
    },
    "Timing": {
        "author": "Hena",
        "artist": "Hena",
        "description": "Stefan has flown all the way to Texas for his best friend Charlotte's four-day wedding extravaganza! Unfortunately for him, that also means spending time with his nemesis of 10 years — Charlotte's brother, Rand. But why is Rand acting so nice? Something strange is going on...",
        "slug": "1246",
        "cover": "https://static.manta.net/2021-11-26/9k/9kIw3sMiNHKdYjqK.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T02:03:05.532Z"
    },
    "I Became a Doting Father": {
        "author": "Kiwoo",
        "artist": "SAYAN",
        "description": "24-year-old Juwon Lee works part-time at a convenience store and lives alone in his small apartment. One day his uncle passes away and leaves behind a 4-year-old daughter, the cute little Yeondu. Instead of letting her be sent to an orphanage, Juwon steps up and decides to be her new guardian.",
        "slug": "1752",
        "cover": "https://static.manta.net/2021-11-09/xN/xNRstpfO1BFDGHge.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-14T06:05:28.640Z"
    },
    "Raising a Sacrifice": {
        "author": "CHAPI",
        "artist": "CHAPI",
        "description": "Inas has always been Duke Nigel Montestein's most faithful knight. But when Nigel is betrayed and killed by Inas, he wakes up a year before his supposed death. Nigel's quick to realize this isn't a mere case of time travel however, and the only one who has answers is the man who betrayed him!",
        "slug": "1829",
        "cover": "https://static.manta.net/2022-06-10/sM/sMiwAZq7QeY494Ii.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T09:43:19.860Z"
    },
    "Meat Humans": {
        "author": "Moraeingan",
        "artist": "Hayandol",
        "description": "When all is destroyed, will you persist? Or will you give in to the gray abyss? In a dystopian world, both the gifted and the wretched are making their last attempts at survival. Their struggles are fierce, and their desperation palpable as they work toward one common goal — to survive.",
        "slug": "1283",
        "cover": "https://static.manta.net/2021-03-28/ew/ewIr7ykDt2gdgtan.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:26:46.142Z"
    },
    "About Jane": {
        "author": "MJ",
        "artist": "MJ",
        "description": "In the year 2099, science has advanced beyond belief. Jane, the school's resident loser and daughter of the world's leading robotics engineer, finally lands a date with her crush on New Year's Eve. But her world is turned upside down when terror strikes, and she discovers the truth about her past.",
        "slug": "1271",
        "cover": "https://static.manta.net/2021-06-07/K5/K5pViXH5uqztx8da.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-21T05:33:29.088Z"
    },
    "Paradise Lost": {
        "author": "Masatoki",
        "artist": "Meal",
        "description": "“Within the walls of the mansion, the chairman’s word is above the law.” That’s the first thing Mincheol, a new bodyguard for Chairman Lim, is taught. No one dares stand up to the wealthy, dictatorial Chairman. But Mincheol, who seems carefree on the outside, is harboring his own objectives. He has a secret motive to bring Chairman Lim down...",
        "slug": "1166",
        "cover": "https://static.manta.net/2020-12-09/xu/xuDx87D1FyUJvvUn.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:48.488Z"
    },
    "Amina of the Lamp": {
        "author": "Eeyeol Chun",
        "artist": "heeya",
        "description": "Amina, one of the last wizards, loses her loved ones when her palace comes under attack. Trying to turn back time to save them, she gets stuck inside a lamp. 300 years later, Jakard, a military commander, wakes her up. He has three wishes before Amina returns to the lamp. What will he wish for?",
        "slug": "1170",
        "cover": "https://static.manta.net/2021-09-03/X9/X9UnfWoE0HK1zFb7.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-04T08:26:08.987Z"
    },
    "Spring and Winter": {
        "author": "Chaedam",
        "artist": "Chaedam",
        "description": "In the middle of the night, high schooler Jungyoon sends a teary text to her ex-girlfriend in the hopes of winning her back. But much to her horror, she discovers that she's actually sent it to Doyoung, the most anti-social girl in her class! Will she be outed at school?!",
        "slug": "1330",
        "cover": "https://static.manta.net/2022-03-23/Gg/Ggo2al3m01PtDfWT.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-03-23T07:15:17.073Z"
    },
    "A Poem of the Empire and a Thousand Piles of Snow": {
        "author": "Huaiming",
        "artist": "Xiacha Shanghua",
        "description": "Xuan Qiancao might be gifted, but she faces constant ridicule and humiliation for being the daughter of a traitor. One day she is helped by Chen Tongxue, the most outstanding figure in the Imperial Academy. She falls in love with him from that moment on and works hard to become his servant.",
        "slug": "1839",
        "cover": "https://static.manta.net/2022-04-28/bc/bcaSaqqrBHpE4sBP.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-01T03:28:40.431Z"
    },
    "I Got Reincarnated to Save Another World But I Just Want to Pet Animals": {
        "author": "Yuriko Takagami",
        "artist": "Yuriko Takagami",
        "description": "I, Midori Akitsu, reincarnated into another world after dying of overwork at age 27. I may have not been popular in the human world, but I'm an idol in the animal world. Now I get to pet birds, dogs, big white tigers, and dragons! I'm fluffing and petting away, all as I try to save the human race...",
        "slug": "1747",
        "cover": "https://static.manta.net/2022-06-28/ay/ayepW73y5LgCMy7f.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T09:20:58.835Z"
    },
    "The Lady and Her Butler": {
        "author": "Jade",
        "artist": "Jade",
        "description": "Sooha is a lone wolf and a hard worker. She refuses to date or marry anyone. However one day, a man appears at her door, begging for a place to stay for the night. Despite being so independent, she allows him to stay with her as her housekeeper. Will she finally let herself fall in love?",
        "slug": "1199",
        "cover": "https://static.manta.net/2022-03-18/bF/bFbKdW3dvqD6uWzK.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:50.452Z"
    },
    "Cat and Dog": {
        "author": "Hee Jung Park",
        "artist": "Hee Jung Park",
        "description": "She's a naive country girl, playful and affectionate like a dog. He's a brooding actor, haughty and reserved like a cat. The two were arranged to be married as kids, and now it's time to start their life together. Will they be able to overcome their differences and find love?",
        "slug": "1309",
        "cover": "https://static.manta.net/2021-04-16/9t/9tTeelhJF9apjwsy.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T06:55:35.809Z"
    },
    "My Accidental Country Life": {
        "author": "Darangeo",
        "artist": "Darangeo",
        "description": "Tricked by his grandfather, city boy Jiyool stumbles into Heedong village and is now the local vet. Nothing seems to go right for him in his new life, until in a sudden turn of events he is reunited with his childhood crush. Will he survive this bumpy ride on country roads?",
        "slug": "1692",
        "cover": "https://static.manta.net/2022-05-19/xD/xDrkggED8MbCDUue.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T02:09:05.384Z"
    },
    "A Very Normal Ending": {
        "author": "Changjae Yoo",
        "artist": "Changjae Yoo",
        "description": "Sayoung Lee is a travel consultant who helps others find their soulmates while they're visiting new places. Though she has no interest in finding a love of her own, her whole world is turned upside-down when the mysterious and hunky Seowan shows up in this riotous rom-com!",
        "slug": "1466",
        "cover": "https://static.manta.net/2022-05-24/I7/I7CoundAKjR7vR1I.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:28:28.293Z"
    },
    "The Night Market": {
        "author": "Kotaro TSUNEKAWA",
        "artist": "Manta Comics",
        "description": "One day Mia finds Yuji, an old friend from high school, waiting for her outside her house. She reluctantly agrees to go with him to a night market which turns out to be run by demons. To make matters worse, they can't seem to escape. Does Yuji know more about this strange place than he lets on?",
        "slug": "1694",
        "cover": "https://static.manta.net/2022-05-23/js/jsGc9IVEmRV9qqCx.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-10T03:35:40.413Z"
    },
    "Lamia Orphe is Dead": {
        "author": "Hadee",
        "artist": "Gamunbi",
        "description": "Despite having been trained to be the next duchess, Lamia Orphe decides to become a knight. Meanwhile, the first prince of the Kingdom, Ethan Taylor, and the second prince, Aquilla Theodore, are engaged in a battle of the throne. Why does Lamia keep waking up crying? How could her fate, both present and past, be intertwined with the two princes? ",
        "slug": "1125",
        "cover": "https://static.manta.net/2022-03-23/zv/zvJt3qLd5bFoGQ9I.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T09:42:23.760Z"
    },
    "Que Sera, Sera!": {
        "author": "Gona Rija",
        "artist": "Sujeong",
        "description": "One night, Hani goes out to drink with her best friend's brother and wakes up... in bed with him? What happens when she becomes pregnant from her one night stand? Watch Hani's trials and tribulations as she tries to hide the truth about the real father.",
        "slug": "1155",
        "cover": "https://static.manta.net/2021-06-07/Fj/FjZUrhppEVrQI6Ud.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-07T03:28:14.002Z"
    },
    "Sorry I’m Not an Angel": {
        "author": "Yoonna",
        "artist": "Yoonna",
        "description": "Born without any malice, benign demon Phil is ostracized by the other demons. When a prank leads him to trespass into heaven, he falls in love with an angel named Chloe at first sight. Determined to win her heart, Phil follows Chloe all the way to Earth... but why is love so difficult?!",
        "slug": "1465",
        "cover": "https://static.manta.net/2022-05-24/5F/5FGMDgIFN7d2hqDr.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-09T03:31:15.036Z"
    },
    "Off Stage": {
        "author": "Dandel",
        "artist": "Dandel",
        "description": "Everyone knows that PAZE is the hottest idol group in Korea. But when one of the members gets injured, leader Haeun and main rapper Jaehyuk have to form a two-man unit in order to keep the group alive! But... why is Jaehyuk so happy about this situation?!",
        "slug": "1728",
        "cover": "https://static.manta.net/2022-03-04/E0/E095fWt4JmEmZEWP.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:42:12.488Z"
    },
    "Sora Haena!": {
        "author": "JACKBULL",
        "artist": "JACKBULL",
        "description": "Sora, a shy high school sophomore at the top of her class, decides she should find a boyfriend to escape her loner status. In an unlikely turn of events, Sora meets Haena, a rebellious, unruly high school junior. The two strike a deal: Haena will help Sora find a boyfriend, in exchange for Sora helping Haena get into college. But what will happen when Sora finds herself falling for Haena instead? ",
        "slug": "1275",
        "cover": "https://static.manta.net/2021-01-21/3h/3hR3Vt8DQQFNlqTD.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:53.031Z"
    },
    "Some Hairy Business": {
        "author": "Haeyahae",
        "artist": "Hamtos",
        "description": "After waking up from a night of drinking, Yeonhee is shocked to find herself in the bed of the hottest guy at school, Saeksi Ahn! And apparently she gave him a Brazilian wax?! Saeksi gives her an ultimatum — tell everyone they slept together and start dating, or he'll reveal their hairy business!",
        "slug": "1869",
        "cover": "https://static.manta.net/2022-06-10/Ld/Ldi65OKaGYuTwyBT.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-25T03:30:53.090Z"
    },
    "The City of Wind": {
        "author": "Kotaro TSUNEKAWA",
        "artist": "Manta Comics",
        "description": "Lost in a park, Jun finds his way home thanks to a mysterious woman he meets on an even more mysterious path. Years later, he revisits this bizarre road with his friend, Haru. They soon discover that not only is this place filled with monsters, but they can't return home! Will they find a way out?",
        "slug": "1923",
        "cover": "https://static.manta.net/2022-05-15/za/za6mNXsiVnBouQjQ.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-20T11:58:44.802Z"
    },
    "Princess of the Animals": {
        "author": "Rayoon",
        "artist": "Manta Comics",
        "description": "Though Elise is forced to live in isolation, she doesn't feel alone thanks to her ability to communicate with animals. That is until she's sent off to marry the ruler of what's known as the Land of the Barbarians! What adventures, and dangers, await Elise in this strange, new world?",
        "slug": "1810",
        "cover": "https://static.manta.net/2022-03-02/kf/kfCbDsIeTHkwgftW.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T02:56:18.091Z"
    },
    "The Tears of a Jester": {
        "author": "Albrecht",
        "artist": "Manta Comics",
        "description": "Life is hard for a court jester. Not only do I serve as an emotional punching bag for the royals and aristocrats, forced to indulge their every whim, but now I'm also caught between two princesses. Is this a comedy? Or will this tale end in tragedy?",
        "slug": "1264",
        "cover": "https://static.manta.net/2022-05-02/JB/JBhA0LBExHbxm6Jb.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:54:19.251Z"
    },
    "A Royal Princess with Black Hair": {
        "author": "ELLIANYANG",
        "artist": "PANG-E",
        "description": "An arranged marriage? Absolutely not. Euricienne will do whatever it takes to get a divorce with Caruel. How will this tomboy princess and blunt prince's marriage go? Princess Euricienne isn't one to shy away from a challenge and she isn't going into this marriage without a fight. ",
        "slug": "1141",
        "cover": "https://static.manta.net/2021-02-19/gy/gyBgORLukMzJNwYb.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T07:51:34.145Z"
    },
    "I Work at a Witch's Mansion": {
        "author": "Changgu",
        "artist": "Changgu",
        "description": "Elena works at a theater troupe as a cleaner with big dreams of making it on stage. But when the troupe is disbanded overnight, she’s forced to find a new job. Luckily, she stumbles upon an old mansion where she’s hired as a maid. But there’s something strange about the madam of the house...",
        "slug": "1223",
        "cover": "https://static.manta.net/2021-12-01/zN/zNBl3SVJGQSFtsIj.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T02:02:38.276Z"
    },
    "The Demon Queen Has a Death Wish": {
        "author": "Geajuck",
        "artist": "Geajuck",
        "description": "After breaking a treaty and waging war against the demons, humanity suffered a crushing defeat. Civilization has been destroyed, and demons are now the ruling species. At the very top, above all others, is the Demon Queen. But the Demon Queen is tired. In fact, she only has one wish: to die!",
        "slug": "1242",
        "cover": "https://static.manta.net/2021-03-07/2S/2SoaNdwfPWtqTn9c.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T02:03:33.424Z"
    },
    "Till We Meet Again": {
        "author": "Jaewook Ko",
        "artist": "KwuanKwuan",
        "description": "I work at a nursing home, taking care of elders living their last days. I deal with their childish tantrums and shed tears as I listen to their life stories. They constantly amaze me with their insights, and most importantly, they remind me of the value of life. ",
        "slug": "1267",
        "cover": "https://static.manta.net/2021-03-09/BI/BI0WcHx7rChrT8IH.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-03T05:57:30.255Z"
    },
    "D.O.T.": {
        "author": "GAYOUNG PARK",
        "artist": "GAYOUNG PARK",
        "description": "Seunghwa Ryu was an unemployed fangirl. But now she gets to work closely with her idols with her friend's help - a dream come true, right? Wrong. Watch how Seunghwa's friendships and work life change as she butts heads with the most popular member of the group, Hyunsoo Kim. ",
        "slug": "1158",
        "cover": "https://static.manta.net/2020-11-19/H3/H3cXBBRsbQU3fsS8.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-08T05:31:41.249Z"
    },
    "Flip Turn": {
        "author": "Sangeon Baek",
        "artist": "Sangeon Baek",
        "description": "Swim instructor Yeonsu’s been given his hardest challenge yet: teaching A-list actor Juhwan Cha how to swim. But when he catches a glimpse of Yeonsu’s bruised-up legs, Yeonsu reluctantly admits that he’s in a BDSM relationship. What happens when the actor proposes something entirely unexpected?",
        "slug": "1216",
        "cover": "https://static.manta.net/2022-02-25/Dq/Dqm4UeHdoc6C3Hpm.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T05:56:48.726Z"
    },
    "No Moral": {
        "author": "SHAMPOO",
        "artist": "SHAMPOO",
        "description": "Yunshin Do is a young and compassionate lawyer who gets recruited by a corporate law firm. His boss, Seheon Kang, is a domineering partner who prioritizes paychecks and only looks out for himself. Will Yunshin be able to prove his worth in court and find a way to melt his boss's ice-cold heart?",
        "slug": "1678",
        "cover": "https://static.manta.net/2022-05-26/cT/cT6GVlzbSwIf5yge.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T05:55:56.809Z"
    },
    "Just Contract Lovers": {
        "author": "mola",
        "artist": "mola",
        "description": "As 34-year-old divorcé Sungyoon contemplates dating again, he runs into an old college friend, Hyunsoo, who's now a famous writer. When he learns that Hyunsoo's in a slump, Sungyoon offers to help... only to be taken aback when Hyunsoo suggests they be contract lovers to spice up his romance novel!",
        "slug": "1727",
        "cover": "https://static.manta.net/2022-05-24/U9/U9Bl339E1udFNIMw.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-04T18:45:19.419Z"
    },
    "The Losing Streak": {
        "author": "Peralta",
        "artist": "Hongwa",
        "description": "Seunga's a lifelong baseball fan, but she's on the verge of calling it quits. Her team, the Futures Victory, is on a notoriously long losing streak — until she kisses a fellow fan, and the Futures happen to win. Now back in the game, the two get intimate to push the Futures up the ranks...",
        "slug": "1227",
        "cover": "https://static.manta.net/2021-11-01/jr/jrVL2Ynzp6YmuWT8.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-12-18T08:28:26.827Z"
    },
    "Across the Milky Way!": {
        "author": "JUNA RU",
        "artist": "KIM KKAEBI",
        "description": "Twin brothers Eunha and Eunsang are polar opposites — Eunha is shy and studies hard, while Eunsang is arrogant and a complete delinquent. When June, Eunha’s crush, mistakes Eunha for Eunsang, Eunha decides to keep up the act. How long can he keep his secret? ",
        "slug": "1249",
        "cover": "https://static.manta.net/2021-01-21/mj/mjlcmINjKo93VuWr.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:51.878Z"
    },
    "Bloody Sweet": {
        "author": "Lee Narae",
        "artist": "Lee Narae",
        "description": "A girl bullied by her classmates accidentally discovers a magical cabinet inside an abandoned church. She is surprised to find a man fall out from the cabinet and lick the blood off her bleeding knees. As she runs away, a mysterious string trails behind her with no end in sight. Where does it lead?",
        "slug": "1197",
        "cover": "https://static.manta.net/2021-02-19/06/06hFcORz0h4VwMYB.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:50.353Z"
    },
    "Deep Blue": {
        "author": "JIAE",
        "artist": "JIAE",
        "description": "After getting involved in a scandal, Kihae is forced to give up his acting career. Then he starts hearing voices whenever he encounters strangers. Therapy, music, avoiding people — he's tried it all, but nothing seems to help. That is, until he meets Mujin.",
        "slug": "1253",
        "cover": "https://static.manta.net/2021-05-24/fv/fvHepMP9l4Ts4UWY.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-21T05:23:06.083Z"
    },
    "Swapping": {
        "author": "Gaetsaeng",
        "artist": "Gaetsaeng",
        "description": "When a rich old man croaks during a passionate round of bedroom escapades, Soheon is accused of being his partner. Not long after, Seoho, the CEO of the company Soheon works for, presents him with a video of the incident... and makes him an offer just can't refuse.",
        "slug": "1686",
        "cover": "https://static.manta.net/2022-04-14/Z5/Z5fIvEsuC5LkMyoZ.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:26:08.549Z"
    },
    "Ideal Us": {
        "author": "Yakkong",
        "artist": "Yakkong",
        "description": "Sahee happens to witness a kiss between two of her guy friends, one of whom was her former crush. She's shocked and confused, which puts a strain on all their interactions. How will these relationships survive with everyone now living under one roof?!",
        "slug": "1294",
        "cover": "https://static.manta.net/2022-05-20/C3/C3TeHhxDtzfaGfnY.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-26T05:36:49.909Z"
    },
    "Idol House": {
        "author": "Handul",
        "artist": "Jaradog",
        "description": "To Irei, who wants nothing to do with hot men, living with a K-pop group for 2 months sounds like the worst idea ever. What will happen when Irei’s mom, a die-hard fan of the K-pop group NiER, wins a contest where the group comes to stay with them and film a reality show? Now Irei must deal with living with 4 hot guys and a love-struck mom.",
        "slug": "1171",
        "cover": "https://static.manta.net/2022-05-24/vA/vAjqVFoKRbJI1pjS.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-24T05:48:16.107Z"
    },
    "Yeona": {
        "author": "HOONNAK",
        "artist": "HOONNAK",
        "description": "Yeona, a middle-aged woman without much life experience, is ready to tackle her bucket list. First up is taking her very first solo trip — but it turns out she's not alone. Fast on her heels is a mysterious man. How does he know Yeona? And why is he following her, lurking in the shadows...?",
        "slug": "1326",
        "cover": "https://static.manta.net/2021-10-15/Zc/ZcBBSf55Jy0EFC3L.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T03:53:22.412Z"
    },
    "Luna": {
        "author": "Bicira Hong",
        "artist": "Bicira Hong",
        "description": "Luna the wolf has been superstar Ryu’s best friend for ten years. Then one night, she turns into a human during a full moon. But her wolf instincts can't be suppressed — especially when Ryu’s life is in danger. Can she protect him from the wiles of his evil uncle, the CEO of his agency?",
        "slug": "1296",
        "cover": "https://static.manta.net/2022-05-24/mj/mjlZskFwXRXkngh8.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-24T05:54:47.452Z"
    },
    "Sosias": {
        "author": "GANG MIN SEOK",
        "artist": "GANG MIN SEOK",
        "description": "Kanghun works as a male escort. He wants to quit since he's in a relationship and doesn't like hiding it from his girlfriend. His life starts to go upside down when a photo of a suspected serial killer is plastered over the media. Is he the killer? Or is someone trying to frame Kanghun?",
        "slug": "1162",
        "cover": "https://static.manta.net/2020-11-19/zi/zibAx4i2vdH4qcno.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T02:03:47.774Z"
    },
    "Immortal Days": {
        "author": "Heo Gin Gae",
        "artist": "Heo Gin Gae",
        "description": "Ever since scientists uncovered the secret to immortality, everyone can live forever. But of course, there are bound to be mutants. Myeol, a mortal, was just trying to get a safe, normal job when he is recruited by Phil, a reckless, good-natured troubleshooter. What will happen when the two mortals join forces to fight off a terror organization? ",
        "slug": "1190",
        "cover": "https://static.manta.net/2020-12-09/ck/ckih4s3BijfCuBq8.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T07:33:41.962Z"
    },
    "A Cat's Tale": {
        "author": "Hyunjoong Kim",
        "artist": "Kwonsam",
        "description": "The animals living on the farm of Saemin’s family are not what they seem. Although they put up an act of innocence in front of Saemin’s family, they are fully capable of deliberately committing horrifying acts. Told from the point of view of an extremely intelligent old cat, this is a thrilling tale of jealousy, manipulation, and murder.",
        "slug": "1119",
        "cover": "https://static.manta.net/2021-02-19/Aw/AwetSN3Rbbd6xKf6.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T08:21:19.081Z"
    },
    "Women's Soccer": {
        "author": "Gabi Nam",
        "artist": "Gabi Nam",
        "description": "Eonam is unexpectedly invited to join the local women's soccer team. With bad group experiences in the past, she isn't sure if soccer is for her. But after that first kick of the ball and getting to know the other women on the team, Eonam's life begins to change for the better.",
        "slug": "1316",
        "cover": "https://static.manta.net/2021-03-05/aa/aaBtfuhrYcRqaNmW.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T02:47:26.242Z"
    },
    "Here Comes The Queen": {
        "author": "Gu Xuan",
        "artist": "Yang Xiao Bai De He Hezi",
        "description": "A weak, C-list actress falls into the sea and returns with a 180-degree temperament change as a frightening and ruthless killer. Bigwigs from all walks of life humbly submit to her. Now referred to as the \"Reaper\", the queen both entertains and punishes evil. Shh, here comes the queen!",
        "slug": "1843",
        "cover": "https://static.manta.net/2022-05-25/Lk/LkEitpcW8MQKsJ5r.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T02:09:29.821Z"
    },
    "Gagavirus": {
        "author": "kimmato",
        "artist": "kimmato",
        "description": "On an alien planet with neither gender nor race, a mysterious virus causes a global chain of crushes! Looks like there won't be any social distancing in this pandemic.",
        "slug": "1460",
        "cover": "https://static.manta.net/2022-05-24/xH/xHU0L2llnDqzm9pD.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:28:22.029Z"
    },
    "Modern Vampire Slayers": {
        "author": "Year One",
        "artist": "Juha",
        "description": "Long ago, vampires were created by the devil as destroyers of humanity. Now a vampire is after something but can disguise itself like anyone. What happens when an experienced and blood-crazed vampire gets loose in the city and no one is there to stop it?",
        "slug": "1148",
        "cover": "https://static.manta.net/2021-05-24/DM/DMU4ePiaa8ExFqEh.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-01-24T15:15:10.757Z"
    },
    "Taming the Tyrant": {
        "author": "Yongtae",
        "artist": "Yongtae",
        "description": "Jae-Ryun seduced and betrayed the tyrannical emperor before being discovered and executed. Now he’s woken up 20 years in the past and crossed paths with the emperor once again. Is this his chance to atone for his sins by reforming the man he loves, or are some romances fated to end in tragedy?",
        "slug": "1685",
        "cover": "https://static.manta.net/2022-04-01/ZN/ZNctHsc7qElmMTnB.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-10T15:37:30.416Z"
    },
    "A World of Artificers": {
        "author": "Muhwa",
        "artist": "Muhwa",
        "description": "When his musician sister suddenly goes missing, wood sculptor Baek Beom is thrown into the world of Artificers, immortal beings that obtain magical abilities through mastery of their craft. Determined to get answers, he teams up with Gino, an Artificer searching for a way to turn back into a human.",
        "slug": "1815",
        "cover": "https://static.manta.net/2022-05-16/jr/jrx6SiEX9zVJd2rt.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T07:10:59.358Z"
    },
    "Sandwiched": {
        "author": "Mandarin Girl",
        "artist": "Mandarin Girl",
        "description": "Five years after moving away, Dongha finds himself reunited with his two childhood friends. But why have they changed so much? Resident troublemaker Juri has become a refined lady, and the sweet and lovely Dabin is now a cynical recluse. Things are about to get complicated between the three...!",
        "slug": "1392",
        "cover": "https://static.manta.net/2022-04-28/1w/1w6W01aXw2BI7CgS.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-30T03:19:48.476Z"
    },
    "Tale of Pram the Wizard": {
        "author": "Honeyball",
        "artist": "Honeyball",
        "description": "Talented young wizard Pram is often misunderstood, clumsy knight Peter wants to feel needed, and Princess Ellie seems to have a split personality. What will happen when these three misfits come together in this wild fairytale adventure?",
        "slug": "1389",
        "cover": "https://static.manta.net/2022-01-23/1n/1nxK62qsDKT1SxFz.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T06:35:51.241Z"
    },
    "The House in the Woods": {
        "author": "Kotaro TSUNEKAWA",
        "artist": "Manta Comics",
        "description": "A young man happens upon a mysterious house in the woods and is chosen as its warden. Much to his horror, however, he learns that he is forever trapped inside, and the only way to be free is to lure in a replacement—an impossible feat that must be accomplished from within the confines of the house.",
        "slug": "1927",
        "cover": "https://static.manta.net/2022-05-23/bM/bMzARu6yLR0Wwwvw.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-04T03:31:32.597Z"
    },
    "Confessions": {
        "author": "Kanae Minato",
        "artist": "Manta Comics",
        "description": "\"From now on, I will refer to them as Suspect A and Suspect B.\"\nMs. Jang is moving on from teaching after her daughter was found dead in the school pool. Her death was deemed a tragic accident, but Ms. Jang suspects otherwise. And before she resigns, she's about to reveal a shocking truth.",
        "slug": "1400",
        "cover": "https://static.manta.net/2022-02-18/cO/cOAyBauAGhJIEk9C.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-10T02:41:06.223Z"
    },
    "Shiba, the Part-Time Waiter": {
        "author": "Karo",
        "artist": "Karo",
        "description": "Sawaka Kinga is a second-year university student working at Shibata Bar, an izayaka in Yokohama. Her fellow part-timer there is none other than Shiba, an adorable canine coworker with a knack for making new friends. Follow these two as they serve some of Hige district’s most interesting clientele!",
        "slug": "1684",
        "cover": "https://static.manta.net/2022-04-14/cl/clqF1jw7zcFE436o.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-08T03:35:09.277Z"
    },
    "The Goblin and I": {
        "author": "Rabong",
        "artist": "Rabong",
        "description": "After surviving an accident, Jiyoo is left with the ability to read memories, thoughts, and emotions left behind in various objects. She's been using her ability for the greater good, but after becoming the subject of unwanted attention, she's decided to stop... until Young turns up at her school.",
        "slug": "1274",
        "cover": "https://static.manta.net/2022-05-05/a9/a9MOmtnCH040V6Lp.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T03:50:37.045Z"
    },
    "Die, Please!": {
        "author": "Euntae",
        "artist": "Euntae",
        "description": "Mina has been planning on telling Yeomyung she likes him. But every time she goes to confess, something foils her plans. It turns out Yeomyung and Youngwoong, her best friend, were actually plotting to kill her. But why?!",
        "slug": "1244",
        "cover": "https://static.manta.net/2021-06-07/Du/Du8lsaWnTXfFPGWh.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T02:25:00.261Z"
    },
    "Vampire Sphere": {
        "author": "AK1.7",
        "artist": "AK1.7",
        "description": "Zhaoyan, Xiyan, and Yuejian’s lives take an unexpected turn after they are injected with a serum that controls demon bloodlines. And in this world of vampires and hunters, they must overcome every obstacle that comes their way. How will the serum change their fates? Can they rise up to the challenge?",
        "slug": "1851",
        "cover": "https://static.manta.net/2022-05-31/rb/rbJirI9nrCidhIDn.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T10:06:07.107Z"
    },
    "Tomb of the Great Swords": {
        "author": "Lily",
        "artist": "Pasta",
        "description": "Jiang Kelan surprises everyone when she's named Master of the Sword Pavilion. With neither the training nor the talent, Kelan faces the scorn of the spirit swords, jealous peers, and the constant criticism of her master. Will the pavilion's wild card be able to reveal her true powers?",
        "slug": "1419",
        "cover": "https://static.manta.net/2021-08-09/7V/7V9bXP7R9kyT6css.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-17T06:50:51.335Z"
    },
    "Death Candle": {
        "author": "Leu",
        "artist": "Leu",
        "description": "Sick of living, Mimi has tried numerous times to take her own life. Much to her dismay, she somehow always ends up surviving. But then she comes across a website called \"Death Candle\" and ends up signing a contract with a demon of death: if Mimi helps him collect souls, he'll help her die.",
        "slug": "1313",
        "cover": "https://static.manta.net/2022-01-23/7k/7kfMWAjKHpjLfGcj.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T08:37:51.936Z"
    },
    "Kiss of Damnation": {
        "author": "Matsultang",
        "artist": "Matsultang",
        "description": "Siyoon's been crushing hard on his high school tutor, Woohyun, and finally works up the courage to confess to him after graduation. Woohyun's answer? \"Let's be friends with benefits.\" One night, Kyunghoo sees Siyoon and Woohyun about to kiss outside a motel, stirring up something within him...",
        "slug": "1292",
        "cover": "https://static.manta.net/2022-02-18/qB/qBMO4H8odAQYO9dO.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-29T05:12:10.658Z"
    },
    "The Paper Menagerie": {
        "author": "Ken Liu",
        "artist": "Manta Comics",
        "description": "A mother breathes life into an origami tiger. A cyborg detective stalks a serial killer. A world overrun by AI. Based on bestselling author Ken Liu's short stories, these four mesmerizing tales set in a world that's not quite ours explore themes of love, loss, and what it means to be human.",
        "slug": "1405",
        "cover": "https://static.manta.net/2021-12-24/zf/zffxTiYtXTcqub1u.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-10T05:09:08.095Z"
    },
    "Rewriting My Dark Past": {
        "author": "TARU",
        "artist": "SOMIN",
        "description": "Our protagonist wakes up to find herself in the world of a novel she wrote in middle school—one she's tried to burn to ashes! Follow Rayna Solei as she navigates her new reality with her loyal servants and a trusty black dragon! Will she ever find her way out of the novel and back to real life?",
        "slug": "1837",
        "cover": "https://static.manta.net/2022-06-10/vD/vDmpdjAGnOFlGw0H.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T16:35:28.773Z"
    },
    "Leave Me Alone!": {
        "author": "fee1",
        "artist": "fee1",
        "description": "After a rough three years in middle school, Doeun decides to return to her hometown and attend high school there for some peace and quiet. But with her old besties now the hottest, most popular guys in school, that might be harder than she thought. Why can't everyone just leave her alone?!",
        "slug": "1435",
        "cover": "https://static.manta.net/2021-12-01/6u/6uLzKdYHfqyoB4tI.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T12:10:20.715Z"
    },
    "No Love Zone": {
        "author": "Danbi",
        "artist": "Danbi",
        "description": "Eunkyum has been at his company for a year now. He's friendly, bright, and has a great relationship with his colleagues. But he's unlucky in love — most likely because he's a sucker for looks. That's why he was thrilled when his hot new boss joined the company... \nbefore he made Eunkyum's life hell.",
        "slug": "1220",
        "cover": "https://static.manta.net/2021-11-26/tw/twYueinjhgYbd6IR.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-02T03:40:50.443Z"
    },
    "Wild Idols": {
        "author": "Liz",
        "artist": "Narang",
        "description": "In a world where animals can live as humans, there exists Marigold, a popular idol group comprised of small, cute animals. Enter Youngwoong, the newest member to be introduced. But with his large hands and piercing eyes, the other members can tell he's different. Could he be… a carnivore?",
        "slug": "1329",
        "cover": "https://static.manta.net/2022-01-19/GD/GDqsKzw2PGFeWsKT.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-01T03:09:32.298Z"
    },
    "Faust": {
        "author": "LIM",
        "artist": "LIM",
        "description": "Back when God, sages, humans, and the Dragon coexisted, there was balance and harmony. But then the Dragon betrayed them and suddenly disappeared, and the world came to an end. This is the story of those left behind in the apocalypse, trapped by the bonds of time.",
        "slug": "1306",
        "cover": "https://static.manta.net/2022-02-18/kT/kTG4PX8YA4e2mDfl.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T07:24:41.131Z"
    },
    "Under the Oak Tree": {
        "author": "namu, Seomal",
        "artist": "P",
        "description": "Stuttering lady Maximilian is forced into a marriage with Sir Riftan, but he leaves on a campaign after their wedding night. 3 years later, he triumphantly returns, ready to cherish her. All fairytales end with a wedding and a happily-ever-after. Their love began with a wedding — this is no fairytale. ",
        "slug": "1255",
        "cover": "https://static.manta.net/2022-04-20/xw/xweLkoWnzXvJIl5F.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-27T13:05:37.136Z"
    },
    "Phantom High": {
        "author": "Gaeun Choi",
        "artist": "Gaeun Choi",
        "description": "Ingan Kim, a normal human man, suffers an unfortunate fate of having to work as a teacher in Hell's Phantom High, where spirits and monsters are students. His only chance at survival is an elixir he uses to hide his human scent. If his students ever find out that he is human, he will be done for. Everyday, he asks himself: will I be able to keep my human scent hidden from these students who will eat me up? ",
        "slug": "1137",
        "cover": "https://static.manta.net/2020-12-03/qx/qxTPdALi7MS5J9SF.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-27T05:11:51.451Z"
    },
    "The Invitation": {
        "author": "Youha Nam",
        "artist": "JEM",
        "description": "On a hot summer's day, Sanghyun's wife is approached by Ingyu, an old friend of her husband's. Although she is wary of his eerie looks and strange demeanor, Ingyu quickly reconnects with her husband, moving in with the two soon after. But after they invite him in, strange things begin to happen…",
        "slug": "1237",
        "cover": "https://static.manta.net/2020-12-15/xz/xzODSPvqeYjrxQ5D.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-13T14:44:30.445Z"
    },
    "The Beau and the Beast": {
        "author": "LB",
        "artist": "Yoo Eun",
        "description": "After getting into a car accident, Hanbyul wakes up in the body of a princess. But something's wrong; she's doubled in size, grown hair everywhere, and seems to terrify everyone who looks her way — she's become a beast! How will she live on as the cursed Princess Alexa?",
        "slug": "1252",
        "cover": "https://static.manta.net/2022-01-28/T6/T6esHL3gAyRePCPA.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-11T13:52:31.303Z"
    },
    "I'm Your Guardian Angel!": {
        "author": "Ryu ho",
        "artist": "Ryu ho",
        "description": "Dove has always been the black sheep among his fellow Angels-in-waiting. To finally come into his own as an official Angel, he must make his designated human happy. But his assignment, Yena Jang, is a girl who already has it all — except love. Will Dove be able to fulfill her wishes?",
        "slug": "1391",
        "cover": "https://static.manta.net/2021-12-01/Wx/Wx3EaDXA0p98cnbp.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T04:29:09.609Z"
    },
    "Love & Courage": {
        "author": "Ha Yangji",
        "artist": "Youngmo",
        "description": "The handsome and ever-so-popular Yonggi seems to have it all. But looks can be deceiving, and he's definitely playing the long con – he's not the Casanova everyone thinks he is! One day, his former classmate Suyeon joins him at the workplace. Will she be the one to finally soothe his anxious heart?",
        "slug": "1688",
        "cover": "https://static.manta.net/2022-03-29/sW/sWGVN6nq5pbnFMtm.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-26T04:33:12.672Z"
    },
    "Slow-Healing Heart": {
        "author": "Hocha",
        "artist": "Hocha",
        "description": "After a traumatic first love, Mijung is determined to put her past behind her and start fresh in college. But when she enters school, she meets an upperclassman with the exact same face as her first love! Will she be able to heal her past scars and learn to love again? ",
        "slug": "1468",
        "cover": "https://static.manta.net/2022-03-04/yI/yIjpkPSWzEapeHwM.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-24T07:21:50.723Z"
    },
    "Traces of the Sun": {
        "author": "Hawaii",
        "artist": "Merin",
        "description": "Strange dungeons have started appearing all over the world and wreaking havoc. Yiseon, a guy with the power to rebuild cities, witnesses his friends being turned into the undead. Hyeon, a powerful hunter, comes to him with an interesting proposition. Yiseon has no choice but to accept his offer.",
        "slug": "1788",
        "cover": "https://static.manta.net/2022-05-12/kD/kDLr28jAXrTahXpZ.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T07:09:36.942Z"
    },
    "Finding Camellia": {
        "author": "Jin Soye",
        "artist": "Manta Comics",
        "description": "Camellia was just 12 when she was taken away from her mother in the slums and forced to live as the son of an aristocratic family. But under the layers of secrets and lies, she never forgets. She continues to struggle to be her true self again, to reclaim the life of Camellia.",
        "slug": "1399",
        "cover": "https://static.manta.net/2022-02-17/Dh/DhuzJEBA7xufGhSn.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T23:32:31.899Z"
    },
    "Terrarium Adventure": {
        "author": "DB",
        "artist": "DB",
        "description": "Obsessed with the clicker game Infinite Diamonds for over a year, Jaehee finally reaches the ultimate in-game achievement — only to suddenly find herself in the RPG gacha game Terrarium Adventure! Why was she pulled into the game, and how can she get out? For now, she has no choice but to explore!",
        "slug": "1691",
        "cover": "https://static.manta.net/2022-05-25/az/azEGUeDoYdhlJ5vD.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-21T05:58:33.826Z"
    },
    "The Golden Light of Dawn": {
        "author": "Seolon Han",
        "artist": "Manta Comics",
        "description": "After losing her family in a demon attack, Rosha is reborn as the 777th most powerful magic knight in the Golden Dawn Society. To avenge her family, she trains hard and rises through the ranks against the odds. Then, she is tasked with protecting little Joshua, who is said to be the Child of God...",
        "slug": "1751",
        "cover": "https://static.manta.net/2022-05-12/pK/pKtLrg88srOzogYH.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T10:06:25.454Z"
    },
    "Who Can Define Popularity?": {
        "author": "Tak Bon",
        "artist": "Tak Bon",
        "description": "Siwon Cha is obsessed with his popularity. Having transformed everything from his weight to his demeanor to remake himself into the perfect popular guy, he loves being the center of attention. What happens when he is challenged by over-eager and equally narcissistic rival Daun Hyung? And why does Daun somehow think Siwon has a crush on him?!",
        "slug": "1204",
        "cover": "https://static.manta.net/2021-11-30/Wa/Wa92bHjWw5OFKbx6.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T08:38:41.902Z"
    },
    "Darae's Big Love Story": {
        "author": "Ggamgyul",
        "artist": "Ggamgyul",
        "description": "Darae's in the second grade, and she's the coolest kid in her class! She's also found her Prince Charming: her best friend's older brother, Inwoo. Join her as the bright and bubbly eight-year-old explores her first big crush in this story of friendship and growth.",
        "slug": "1295",
        "cover": "https://static.manta.net/2021-06-11/0Q/0Qn7hcmdFTLpmSBD.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-23T07:27:52.451Z"
    },
    "As the Moon Wanes": {
        "author": "Bokyung Kong",
        "artist": "Yongsa",
        "description": "\"There's a forest that steals shadows?\"\nHyojoo is on the verge of losing her shadow to a menacing forest and disappearing forever when she meets Muyoung, a mysterious yet beautiful man. In this fairy tale romance, the two race against time as the moon slowly wanes...",
        "slug": "1266",
        "cover": "https://static.manta.net/2021-10-14/QM/QMWSvVHgLGQO72OK.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T14:31:33.766Z"
    },
    "I'll Save This Damned Family!": {
        "author": "Munirang",
        "artist": "NU",
        "description": "After being murdered, Yeonwoo is reincarnated as Tara Elias, the unremarkable and incompetent 5th daughter of the Elias family. How will Tara Elias, the nobody of the family, save the entire household from its grisly ending and become the ruler of the kingdom?",
        "slug": "1376",
        "cover": "https://static.manta.net/2022-04-01/9j/9jP86RwhxHRvkFvv.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-20T03:35:37.476Z"
    },
    "Iris: The Lady and Her Smartphone": {
        "author": "Swan",
        "artist": "Yoon Hye",
        "description": "Betrayed by her family and murdered by her own husband, Iris's life flashes before her eyes. After recalling memories of a past life, she wakes up, alive. This time, Iris is determined to never be abandoned again. Will she succeed in her quest for vengeance?",
        "slug": "1677",
        "cover": "https://static.manta.net/2021-10-15/Ca/Ca8ZZMqnklmpeJ7e.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-27T05:11:13.334Z"
    },
    "Let's Kill Your Husband": {
        "author": "Hideo Okuda",
        "artist": "Manta Comics",
        "description": "Your shaky demeanor, the bruises on your face... It killed me to see how you'd changed after getting married. Maybe we should just kill your husband. But how? Will our lives ever be the same again? Fate must have been on our side, because everything went smoother than expected.",
        "slug": "1324",
        "cover": "https://static.manta.net/2021-11-01/2e/2eiatxEfpHv5p717.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-10T02:41:26.694Z"
    },
    "Master of the Wind and Moon": {
        "author": "Yoonsun Park",
        "artist": "909",
        "description": "During the Silla dynasty, both male and female courtesans fill the halls of Unru, a brothel located on a mysterious island shrouded in fog. It is here that two longtime friends, Yeol and Sadam, begin to explore their feelings for one another. Enter Queen Jinsung, who has her eye on Yeol.",
        "slug": "1452",
        "cover": "https://static.manta.net/2021-11-05/h3/h3aSINzYO4ZU2vra.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-05T03:44:51.370Z"
    },
    "Visions of the Night": {
        "author": "Kotaro TSUNEKAWA",
        "artist": "Manta Comics",
        "description": "Lio lost everything she held dear when her home burned down and her grandmother went missing in a suspicious incident years ago. Now, left with nothing to trust but her mysterious powers of illusion, she hopes to discover the truth of her tragic past in a world where nothing is what it seems to be.",
        "slug": "1693",
        "cover": "https://static.manta.net/2022-06-08/B5/B5KOHjLziXWWVii7.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T03:30:21.644Z"
    },
    "Disobey the Duke if You Dare": {
        "author": "Romance Machine K",
        "artist": "Manta Comics",
        "description": "After her second husband's death, Lily is forced into a third marriage by her father. Her new husband is rumored to be a monstrous warmonger, but to Lily's surprise, the Duke turns out to be a kind man and husband. There's just one catch... she must never see his face.",
        "slug": "1789",
        "cover": "https://static.manta.net/2022-05-12/pS/pSIzAxbwQzRjoOKH.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-26T03:40:10.518Z"
    },
    "Pills for Skills": {
        "author": "Manta Comics",
        "artist": "Yunana",
        "description": "The day I decided to disappear from this world, I met a cat that offered me the gift of acquiring someone else's ability. I was given five magical pills that would each take off 7 years of my life. But little did I know, each pill also came with more dire consequences. ",
        "slug": "1131",
        "cover": "https://static.manta.net/2020-11-19/df/dfz9WWh50ycqnbRE.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T14:32:42.670Z"
    },
    "Merry Go Round": {
        "author": "NASOL",
        "artist": "NASOL",
        "description": "When angsty teenager Jisoo moves to a new school her senior year, she just wants to lay low. Despite such wishes, she finds herself in a complicated friend group. As she begins modeling for Jinju’s portfolio, she grows closer to photographer Yeojun. What will happen when Yeojun and Jisoo enter into a fake relationship to make Yeojun’s ex, Hyerim, jealous? A story of four friends, jealousy, and love. Who said high school was easy? ",
        "slug": "1269",
        "cover": "https://static.manta.net/2021-02-19/CL/CLEaLzsGr7jCtGYh.JPG",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:02:01.757Z"
    },
    "Adios, April": {
        "author": "Hye bin",
        "artist": "Hye bin",
        "description": "After the tragic death of her sister, April is sold off by her father for just three pieces of silver. With no one to turn to, she's soon purchased by a duchess and begins working at her castle. But everything changes once she catches the eye of her new master...",
        "slug": "1385",
        "cover": "https://static.manta.net/2021-09-17/da/daZPbAB4w13UExAP.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T07:01:22.615Z"
    },
    "Blush Pink": {
        "author": "Tomato",
        "artist": "Tomato",
        "description": "When Eunyu visits a cafe with her friend, she wasn’t expecting to fall in love at first sight with the barista. Although Eunyu can’t help blushing just at the thought of him, she doesn’t even know his name! What’s more, Eunyu can barely talk to him -- whenever she tries, she is too nervous and ends up saying all the wrong things. Will Eunyu be able to make her unrequited love a requited one?",
        "slug": "1135",
        "cover": "https://static.manta.net/2021-12-17/fI/fIUBw9mVm30MpKkf.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-04T00:23:43.337Z"
    },
    "Dragonsitter": {
        "author": "Zica",
        "artist": "Zica",
        "description": "The last living dragon, Axela, lives isolated in a fort with wine as his only comfort. Meanwhile, Corette, an orphaned but optimistic girl, moves in as his caretaker and ferociously tries to get him to warm up to her. Will the two overcome their differences and bickering? What will Axela do when Corette is suddenly taken hostage by the queen? ",
        "slug": "1181",
        "cover": "https://static.manta.net/2021-06-07/Dn/Dn4V9UjfqIbnBpLf.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:49.436Z"
    },
    "The Youth Pill": {
        "author": "Inyeong Bang",
        "artist": "Macaron",
        "description": "College student Soong has a secret: she’s 121 years old. With the invention of a wonder drug, anyone can look 21 again. And in a world without visible aging, why act your age? Anything is possible — even a romance with a man 100 years your junior.",
        "slug": "1297",
        "cover": "https://static.manta.net/2021-05-21/qj/qj0KzXq0f2SeIetC.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-01-05T08:00:59.503Z"
    },
    "Love Order": {
        "author": "Sesame",
        "artist": "Sesame",
        "description": "Just dumped, Eva turns to the comfort of food to heal her broken heart. But little does she know that her childhood friend, James, may just be the comfort she needs! Can James help Eva cook up a cure for heartbreak? Or will it be a recipe for disaster?",
        "slug": "1403",
        "cover": "https://static.manta.net/2021-10-15/0X/0XzEB9A7c5PDpum6.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T02:47:57.543Z"
    },
    "The Scent of You": {
        "author": "Lee Manse",
        "artist": "Lee Manse",
        "description": "When Kamin steals a kiss from his sleeping classmate, Kanggo, he’s positive he’ll never get caught. But what he doesn’t know is that Kanggo has a unique gift — he can smell emotions. Now, Kanggo’s on the hunt for the identity of his secret admirer, whether Kamin likes it or not. ",
        "slug": "1431",
        "cover": "https://static.manta.net/2021-12-08/Ca/CaLwmlNDQ5xpz1cM.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-29T08:53:13.289Z"
    },
    "Shall We Pole Dance?": {
        "author": "MANN",
        "artist": "NANDOL",
        "description": "Despite the taboo surrounding it, pole dancing is one of the most vigorous physical exercises out there. Though initially self-conscious about her new hobby, our protagonist learns to love her own body and herself through the art of pole dancing. So, then... Shall we dance?",
        "slug": "1443",
        "cover": "https://static.manta.net/2021-12-01/8P/8PGpbbnSzos7Pqto.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-07T08:27:24.742Z"
    },
    "My Husband, My Sister, and I": {
        "author": "PISTACHIO",
        "artist": "WOOSA",
        "description": "On the night of our fourth wedding anniversary, I witnessed my husband having an affair. \"I love you,\" he told my twin sister as he laid on top of her. This can't just end easily with a divorce. No, I'll make them pay for this.",
        "slug": "1771",
        "cover": "https://static.manta.net/2022-05-24/v1/v1OecZkm6FfbLzro.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T00:26:22.893Z"
    },
    "The Noble Pirate": {
        "author": "Seodamyeon",
        "artist": "Manta Comics",
        "description": "When the infamous pirate Rosetta gets poisoned to death, she wakes up in the body of noble lady Leah. Now, to avoid a second death, Rosetta must play the part of a noble and... get engaged?! But to whom? Could it be to the strange admiral who has suddenly come chasing after \"Rosetta\"? ",
        "slug": "1794",
        "cover": "https://static.manta.net/2022-05-12/dL/dLyzZjRgAYEBVDNl.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T07:22:21.128Z"
    },
    "My Super-Granny": {
        "author": "Jian Lee",
        "artist": "Jian Lee",
        "description": "After spending her entire life working in the fields and taking care of her family, Granny's been diagnosed with dementia — and I’m her new caretaker. Now I’m starting to understand the hardships of the women who’ve grown up in the patriarchy.",
        "slug": "1375",
        "cover": "https://static.manta.net/2021-09-19/WV/WVb6dmjW8WyAqo0h.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-07T08:27:16.674Z"
    },
    "Finding Camellia (Novel)": {
        "author": "Jin Soye",
        "artist": "Manta Comics",
        "description": "Camellia was just 12 when she was taken away from her mother in the slums and forced to live as the son of an aristocratic family. But under the layers of secrets and lies, she never forgets. She continues to struggle to be her true self again, to reclaim the life of Camellia.",
        "slug": "1737",
        "cover": "https://static.manta.net/2021-11-01/Az/AzyuaogkzrtxpGnR.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-13T14:43:34.881Z"
    },
    "The Year of No Shopping": {
        "author": "Hyejung Park",
        "artist": "Jian Lee",
        "description": "After finding out her rent is going to increase, Jina Yoon decides it's time for her to move. But wait... She's broke because she spent all her money on clothes! Join Jina on her year-long challenge to not buy any new clothing. Will she be able to end her addiction to shopping?",
        "slug": "1865",
        "cover": "https://static.manta.net/2022-06-08/BS/BS9Uk0bRgLdEnigi.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-23T03:30:48.325Z"
    },
    "Mantis": {
        "author": "Seokhwan Kim",
        "artist": "Seokhwan Kim",
        "description": "\"She was supposed to be the last...\" How will the lonely carpenter evade the eyes of the law? Will the investigators catch up to his plans? Follow the police in their attempts to catch the thrilling murders of an OCD serial killer. ",
        "slug": "1122",
        "cover": "https://static.manta.net/2020-11-19/IH/IHfETOiuyJxgwdaS.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:56.119Z"
    },
    "To the Rooftop": {
        "author": "Taehwan Hwang",
        "artist": "eunduk",
        "description": "During a zombie apocalypse, five survivors have taken refuge inside an old building. Food is delivered to the rooftop, but the only way up is through a chute too small for the average adult. Seongguk's dwarfism makes him the only candidate, but when he faces backlash, dark ideas begin to stir…",
        "slug": "1236",
        "cover": "https://static.manta.net/2021-10-25/QH/QHf8weOSDypVJY0f.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T14:30:31.550Z"
    },
    "Our Idol Sangeun": {
        "author": "simsang",
        "artist": "simsang",
        "description": "Nokram is a utopia, its citizens happy and smiling… except for Juri, who sees a paradox in the facade of happiness. At her school’s graduation, she stumbles upon a dark secret, and after a failed escape, she is saved by a girl with mysterious abilities. Will this new hero be the key to her way out?",
        "slug": "1798",
        "cover": "https://static.manta.net/2022-06-29/pv/pvOe6e4bcG3qYsad.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T03:30:06.872Z"
    },
    "Biting the Tiger": {
        "author": "Mindal Park",
        "artist": "Mindal Park",
        "description": "Yunho, vocalist of a popular band, has had a secret crush on his friend Kyunghoon for years. That is, until Kyunghoon announces that he has fallen in love with another man. In despair, Yunho runs away and bumps into Hanwool, a mythical tiger grim reaper.",
        "slug": "1194",
        "cover": "https://static.manta.net/2020-11-24/q5/q584wfsDFZtYbqx1.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:49.540Z"
    },
    "Insta Girl": {
        "author": "Minhye Kim",
        "artist": "Muscat",
        "description": "Gabi miserably works a low-paying job at a nail salon. When Jinju, an Instagram influencer who seems to have it all, visits the salon, Gabi decides she wants to live her life. As Gabi begins a double life of pretending to be just like Jinju, their lives become more intertwined. What secrets of the Instagram celebrity will Gabi uncover? ",
        "slug": "1127",
        "cover": "https://static.manta.net/2021-02-19/LW/LWs3AQDjPkGgo0VS.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T08:21:25.401Z"
    },
    "Quiet Days": {
        "author": "Sehee Kim",
        "artist": "kaenopi",
        "description": "Kyoungjin's new job is writing fake product reviews as the fictional blogger, \"Lady Chatterley.\" And she's good at it. But one day, she receives a letter reading: “B's disinfectant spray poisoned my children. We started using it after reading your review...”",
        "slug": "1238",
        "cover": "https://static.manta.net/2020-12-15/AF/AFmTo2e6e8PySPvW.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T14:31:12.915Z"
    },
    "Mirror Game": {
        "author": "Sunny",
        "artist": "Baolong",
        "description": "Master illusionist K becomes a viral sensation after successfully hypnotizing people through their streams. But for their very last trick, they hypnotize all their viewers to commit mass suicide. Meanwhile, Jinwoo wakes up with missing memories and a video from K. Can he break K's spell in time?",
        "slug": "1279",
        "cover": "https://static.manta.net/2021-06-02/Vy/Vyvmzo20ChqQoe0E.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-14T06:05:05.963Z"
    },
    "Flowers Find a Way to Bloom": {
        "author": "CarpeXD",
        "artist": "YongGo",
        "description": "Nam Goong Yun is sickly with a bad temper. He wakes up one day to find he has traveled ten years back in time into the body of Baek Mo Ran, whom he used to bully! The years pass, and Yun finally regains control of his own body. But the question remains: Where was Mo Ran during all that time?",
        "slug": "1394",
        "cover": "https://static.manta.net/2022-05-24/4u/4usvhqQYiy70jk7O.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:35:32.152Z"
    },
    "The Stairway of Time": {
        "author": "JooYoung Ha ",
        "artist": "Zenyu",
        "description": "Yuna is nothing like she was 14 years ago. She’s no longer the innocent girl who fell in love with Jihoon, and she definitely can’t forget the cruel fate that awaited them. When Yoona has the chance to go back to the past, she only has one goal: to avoid Jihoon. When he keeps pursuing her, can she resist the temptation to fall in love again?",
        "slug": "1153",
        "cover": "https://static.manta.net/2022-06-22/Fk/FkBDGSxS5GO3fLzc.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T07:08:09.559Z"
    },
    "Falling for the Enemy": {
        "author": "Mieun Lee",
        "artist": "Manta Comics",
        "description": "After her parents’ death, Lia versed herself in swordsmanship to protect her family. But as the Empire’s only female Commander of a knights' battalion, she can't seem to catch a break because of the meddling Duke Edgar!\nBut wait... Why does this “enemy” blush whenever he looks her way?! ",
        "slug": "1786",
        "cover": "https://static.manta.net/2022-07-05/ap/apO65fOt7LUzFrMX.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T00:26:54.994Z"
    },
    "Love of Cloud and Rain": {
        "author": "Moscareto",
        "artist": "Okdong",
        "description": "On the day of his new vet clinic's opening, Jung finds a sickly lizard at his doorstep. But the lizard soon turns into a human... and it turns out he's the Dragon King's son! Can the arrogant yet sexy Prince Woonwoo convince Jung to help him become a full-fledged dragon through intimacy?",
        "slug": "1270",
        "cover": "https://static.manta.net/2022-01-19/Gr/GrrCWUiWETdEmQUs.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-25T05:25:08.106Z"
    },
    "My Father is a Tyrant": {
        "author": "Night Witch",
        "artist": "Night Witch",
        "description": "After working herself to death, Professor Jaehee Cheon is reincarnated as a princess in a fantasy novel. Now, she must find her father from the four gorgeous candidates before her to find her happy ending. Will Jaehee be able to survive in her second life?",
        "slug": "1243",
        "cover": "https://static.manta.net/2022-01-19/nT/nTebuM3nNDPdFcT9.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T02:38:22.340Z"
    },
    "Science Tikitaka": {
        "author": "Mooseon",
        "artist": "BAEM",
        "description": "Think science is boring or intimidating? Think again! Learn about how nitrogen revolutionized global food production, how plastic started with a billiard ball before taking over the world, the hackers who created the information age, and more!",
        "slug": "1863",
        "cover": "https://static.manta.net/2022-06-09/B7/B7sdTWlmW63C6KjU.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T00:00:59.259Z"
    },
    "Happiness Starts at Home": {
        "author": "Bakseonuu",
        "artist": "Bakseonuu",
        "description": "Creating the perfect home doesn't have to cost an arm and a leg. Follow four women with strong personalities as they share with you their tips and tricks on DIY interior decorating. Learn how to look after both your living space and yourself in order to take back control of your life.  ",
        "slug": "1787",
        "cover": "https://static.manta.net/2022-02-18/pt/ptEnPOxSqUTXHKCi.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-09T01:23:31.379Z"
    },
    "Fading Vows": {
        "author": "Manta Comics",
        "artist": "kuri",
        "description": "Wedding planner Muran has finally moved into her own apartment, but she gets so swept up in the excitement that she ends up spending all her money on decorations. Now, she finds herself in desperate need of a roommate to share the rent with her. What will happen when her coworker suggests she move in with her younger brother, Sachung?",
        "slug": "1453",
        "cover": "https://static.manta.net/2021-12-01/Qt/QtBy6VzPma88tPXt.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T08:31:07.845Z"
    },
    "Semantic Error": {
        "author": "J. Soori ",
        "artist": "Angy",
        "description": "Sangwoo Choo is a stickler for rules. So when his classmates free-ride on a group project, he doesn't credit them. But this prevents one senior, Jaeyoung Jang, from graduating. And like oil and water, Sangwoo and Jaeyoung don't mix. Can Sangwoo debug Jaeyoung — a semantic error in his perfect life?",
        "slug": "1251",
        "cover": "https://static.manta.net/2021-11-01/bH/bHxWwO7rCtLsIKjd.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-29T13:35:26.152Z"
    },
    "Youth Market": {
        "author": "Kyuho Son",
        "artist": "Karibo",
        "description": "What if everyone who was still unemployed by the age of 29 was kidnapped and hunted for sport? Welcome to the dangerous world of the Youth Market.",
        "slug": "1321",
        "cover": "https://static.manta.net/2022-04-18/Jc/JchRvn1nLy72Bukd.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T00:09:01.581Z"
    },
    "Flash Behavior": {
        "author": "michi",
        "artist": "michi",
        "description": "Eaters — intelligent creatures from outer space that prey on Earthlings. Problem is, even though they look like humans, no one knows how to talk with them! Enter Yuli, the only known human to date who can communicate with the Eaters. Can Yuli save the world AND her love life?",
        "slug": "1773",
        "cover": "https://static.manta.net/2022-02-04/Ey/Eyti3HY39esQwRql.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T03:34:52.288Z"
    },
    "Love Jinx": {
        "author": "Geonhan",
        "artist": "Geonhan",
        "description": "Haekyung's got it all: looks, personality, job. But there's one thing messing up his seemingly perfect life — a jinx. Whenever he kisses someone, he gets dumped, his projects fail, and general misery ensues. Now freshly single, will Haekyung be able to overcome his jinx?",
        "slug": "1413",
        "cover": "https://static.manta.net/2022-01-19/t0/t0E48J8AfqXNUKXL.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:25:22.808Z"
    },
    "Clover Under My Feet": {
        "author": "TASSO",
        "artist": "TASSO",
        "description": "May Han is a mutant in a world where people are divided into five species: dogs, cats, rabbits, tigers, and foxes. May, despite being a rabbit, is abnormally tall, and has been bullied her entire life for being such a mutant. What will happen when she meets another mutant, Jun Kang? Will she be able to reconcile her traumatizing past and find love in this unforgiving world? ",
        "slug": "1256",
        "cover": "https://static.manta.net/2022-05-24/aC/aCSw6furQmNuOuH0.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-24T05:53:15.425Z"
    },
    "For Vagina's Sake": {
        "author": "Kyoungsun",
        "artist": "Kyoungsun",
        "description": "Blood sisters trapped by the taboo surrounding menstruation. A tribute to all the women suffering each month. A choice made purely for myself, and a new narrative only women can lead — the story of a woman who learned about menstruation and began to see her body in a new way.",
        "slug": "1288",
        "cover": "https://static.manta.net/2021-02-16/bu/bu5428Hh6UuCGQpa.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T04:09:52.085Z"
    },
    "Isnelda": {
        "author": "Sohwagi",
        "artist": "Sohwagi",
        "description": "After suddenly becoming an orphan, Isnelda is sent to live with her cold relatives until she reaches adulthood and can gain her inheritance. Yet upon becoming an adult, a benefactor returns to Isnelda's life, opening her eyes to a world of wealth, greed, lust, and... magic? What could go wrong?",
        "slug": "1825",
        "cover": "https://static.manta.net/2022-05-24/7y/7yfNOzPNLJQPygoQ.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T01:13:33.861Z"
    },
    "The Most Beloved": {
        "author": "Dou Sha",
        "artist": "Xiaolongbao",
        "description": "After her untimely demise, Xue Rong is rewarded with the chance to be reincarnated — but this time as some sort of cute, furry creature! She soon realizes that not only is she in the distant past, but also smack dab in the middle of an academy full of beautiful men!",
        "slug": "1841",
        "cover": "https://static.manta.net/2022-06-20/Em/EmXazyVfC4SE8PcS.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T04:10:08.702Z"
    },
    "Does Love Need a Translator?": {
        "author": "Hwiyo",
        "artist": "Hwiyo",
        "description": "College student Hadam desperately needs a recommendation letter from her professor. The only way to get it? Be a mentor to an exchange student and house them for a full semester. Hadam was expecting a female, but the exchange student turns out to be… a handsome French male?! What will happen when Hadam has to live with him under the same roof? Will they be able to overcome the language barrier to find love?",
        "slug": "1149",
        "cover": "https://static.manta.net/2021-05-04/zc/zcdEP6QaBbGKDJCd.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-25T05:26:56.901Z"
    },
    "The Tiger That Swallowed the Moon": {
        "author": "Nabit",
        "artist": "Lufer",
        "description": "Taebom Gwak, an Olympic gold medalist of the national shooting team, suffers a dangerous hit-and-run accident. The person who he used to call \"Daddy-Long-Legs\" suddenly appears in this life-or-death situation, ten years after he's disappeared from Taebom's childhood. But he is actually ... a vampire?!",
        "slug": "1152",
        "cover": "https://static.manta.net/2020-12-02/Fg/FguO3RdHHwtyMBoH.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-03-14T07:13:42.331Z"
    },
    "Bound": {
        "author": "Gwendolyn",
        "artist": "Mandu Fairy",
        "description": "As a young boy, Shinyeon falls in love with the crown prince at first sight. But he knows better than to harbor such feelings — his sister is vying for the title of crown princess. Determined to suppress his emotions, he leaves to fight in the war. But love is ever persistent... and cruel.",
        "slug": "1456",
        "cover": "https://static.manta.net/2022-06-29/79/798shZsy4IC9X4xf.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-10T03:42:55.382Z"
    },
    "Lies Become You": {
        "author": "Seoru",
        "artist": "Manta Comics",
        "description": "Femme fatale Veronica is sentenced to death for obsessing over the prince. With her life now in danger, she boards a ship to escape, unaware that it belongs to her archnemesis, the alluring Prince Halid. He agrees to help her, but only on the condition that she pretends to be his wife!",
        "slug": "1793",
        "cover": "https://static.manta.net/2022-05-24/eG/eGQqcDyrcJVqzcE8.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-04T09:15:08.847Z"
    },
    "The Old Man and the Snow Sprite": {
        "author": "Yerim",
        "artist": "Yerim",
        "description": "This little snow sprite is looking for fun, friends, and a place where it belongs — and not even a grumpy old man can stop it! As winter deepens and the snow sprite burrows itself into his life, the old man discovers a joyous warmth that he could have never expected.",
        "slug": "1464",
        "cover": "https://static.manta.net/2021-12-02/XZ/XZFVrl2WsXJElkTW.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-03-29T15:38:51.282Z"
    },
    "Lost Princess": {
        "author": "KATINO",
        "artist": "KATINO",
        "description": "For as long as Olga can remember, she’s dreamed of setting sail with her beloved father and brother. But when the two go missing, it seems like those dreams are shattered — that is, until she stumbles upon a treasure hunt across the high seas! What adventures will unfold for Olga and her crew?",
        "slug": "1730",
        "cover": "https://static.manta.net/2021-12-01/Qt/QtcnpPBnu8NVtlrm.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-14T06:04:30.520Z"
    },
    "Girl from the Future": {
        "author": "Yooha Nam",
        "artist": "Hyeon Jin",
        "description": "2118, USA.\nDean lost his wife in a car accident. When he hears of a man who disappeared without a trace thanks to a Time Paradox, he makes a plan to pass painlessly and join his wife. And so, Dean travels 50 years into the future.\nHe meets a woman there. She looks shocked to see him. \n\"Are you...?\"",
        "slug": "1234",
        "cover": "https://static.manta.net/2020-12-15/l8/l87ISpsRfM3Vg43V.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T14:29:49.208Z"
    },
    "Her Story": {
        "author": "LEE JaHyeon",
        "artist": "LEE JaHyeon",
        "description": "Playboy Ondal lives a life of wooing women and seeing ghosts. His curiosity is piqued when he hears about a serial murderer involving the supernatural, and his investigation leads him to a widow who had lost her husband in a similar manner years ago. Ready to face the truth, he hears her story.",
        "slug": "1327",
        "cover": "https://static.manta.net/2021-11-16/2H/2HOUhUz7lQ9a2X8g.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-24T03:01:54.145Z"
    },
    "Stand Up, Now!": {
        "author": "Garden",
        "artist": "Writer 1",
        "description": "What's the anatomy of a joke? Should you cross the line between funny and offensive? How do top comedians hone their craft, and how did stand-up start in the first place? Dive into the world of humor with your first ever webtoon guide to stand-up comedy!",
        "slug": "1795",
        "cover": "https://static.manta.net/2021-12-20/1y/1yD2IxLrJ9R8iSWC.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-09T01:21:38.904Z"
    },
    "4 Week Lovers": {
        "author": "Maroron",
        "artist": "Maroron",
        "description": "Dojun's life at college is off to a perfect start! Until he meets his roommate, Jaehee, a high school friend whom he may have ghosted. Jaehee claims he's over their unresolved past, but after an accident resulting in a fractured wrist, he makes Dojun a proposition...",
        "slug": "1215",
        "cover": "https://static.manta.net/2022-03-22/qm/qm2DH4gy5gMBgaON.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-01T03:44:40.466Z"
    },
    "A Bookstore Romance": {
        "author": "Ohu",
        "artist": "Ohu",
        "description": "When she interviewed for a job at an antique bookstore, Bora Kang definitely wasn’t expecting to witness the magical events she did. Having found out these long-kept secrets of the bookstore, she is forced to enter into a binding contract. As she becomes entangled with the store and Seokyum, the handsome yet elusive storeowner, what other secrets will she uncover of the bookstore and its inhabitants? ",
        "slug": "1140",
        "cover": "https://static.manta.net/2021-02-19/OU/OUIgXIye93LgFxt9.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-03-22T15:02:56.996Z"
    },
    "Neap Tide": {
        "author": "Jung Ki Rim",
        "artist": "Oh Eun Ji",
        "description": "Ever since they were little, Sewoon believed that he and his best friend Dobin only had each other. But when a rift between them makes room for the newcomer, Daebum, Sewoon’s torn on who to choose: the beautiful but cold Dobin, or the warm and inviting Daebum? ",
        "slug": "1439",
        "cover": "https://static.manta.net/2022-05-03/sc/scIVX9NNuPEQcrIA.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-04T18:49:45.910Z"
    },
    "The Black June": {
        "author": "DOXX",
        "artist": "DOXX",
        "description": "Philip, an exorcist, is suddenly thrust into a bunch of supernatural murder cases — that all seem to be the result of one person, Lucifer. Philip, having previously been tortured by Lucifer, vows to get to the bottom of these murder cases and set things right once and for all. ",
        "slug": "1116",
        "cover": "https://static.manta.net/2021-02-19/iX/iXslkeaRPhHcZ9Bo.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:25:14.260Z"
    },
    "Matchmaker": {
        "author": "Gguljamong",
        "artist": "Gguljamong",
        "description": "Hojoon has always had a recurring dream that features the same girl. When a new coworker claims to be that girl and his soulmate, his world is turned upside down. As he starts regaining memories of what might have been his past life, something doesn’t feel right. Will he be able to piece together the truth? Are all soulmates really meant to be?",
        "slug": "1161",
        "cover": "https://static.manta.net/2020-11-19/fW/fWKW7U82ljjpO7aF.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T05:30:19.879Z"
    },
    "Necromancer": {
        "author": "Hongjacga",
        "artist": "Hongjacga",
        "description": "Death is usually the end. But for Erik, who finds himself revived after a fatal betrayal, it’s just the beginning. Together with Moll, the mysterious girl who brought him back from the dead, the two embark on a journey seeking revenge and salvation.",
        "slug": "1310",
        "cover": "https://static.manta.net/2021-03-07/Ju/JuynDJj60j4xZB7L.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-03-04T08:29:36.247Z"
    },
    "Stone House on Jeju Island": {
        "author": "Summer Yang",
        "artist": "Ninyoung",
        "description": "3rd-generation Korean-American Brenda falls in love with Jeju Island while researching its female divers. She decides to take the plunge and move to the island with her husband. There, she dives deep into Jeju's history and culture while healing, growing, and building friendships along the way.",
        "slug": "1446",
        "cover": "https://static.manta.net/2021-12-01/Qz/Qzqzxspo5Y9scaSr.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-07T08:27:32.803Z"
    },
    "Collide": {
        "author": "Wann",
        "artist": "Wann",
        "description": "Joy suddenly becomes involved with a secret group of superpowered individuals due to a genetic trait. Joy's fate changes rapidly as she gets caught up in a war between the superpowered. Things grow complicated as a top-class superpower user named Moowon becomes dangerously attracted to Joy...",
        "slug": "1200",
        "cover": "https://static.manta.net/2021-02-19/5E/5ExZJidlEoFxLTHj.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:50.457Z"
    },
    "Nice to Meet You": {
        "author": "So One",
        "artist": "Kkori",
        "description": "“What does it matter if we have a 70-year age difference?” \nJinha, an office worker who is traumatized from the bullying in her past, receives a mysterious message from the future...\nA time slip story of fantasy and romance transcending time and space. ",
        "slug": "1284",
        "cover": "https://static.manta.net/2022-02-18/Al/Al2EokrGKEDidcXW.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-10T08:19:50.255Z"
    },
    "In Your Dream": {
        "author": "Kim Kwangmin",
        "artist": "Dorang",
        "description": "Junsu is distraught after witnessing his crush get into a car accident. To save her from a life-threatening coma, he braves a dangerous journey into the depths of her dreams. But when Namhee awakes, she has no memory of the man who saved her... Will they be able to find love again?",
        "slug": "1334",
        "cover": "https://static.manta.net/2021-05-30/Hh/HhsMxA7jsn9p03Ma.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T06:55:53.324Z"
    },
    "My Boyfriend is a God": {
        "author": "Nakyung",
        "artist": "Prin",
        "description": "Miso Lee lives an uneventful life. Then one day, a man drops down from the heavens before her and claims to be a god. He also insists that Miso has a ring… one he had given to his lover centuries ago. Is he telling the truth? And if he is, does that mean Miso is the reincarnation of his old lover?",
        "slug": "1320",
        "cover": "https://static.manta.net/2022-04-07/PQ/PQbXK5Ob8Xo5gfYU.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-10T03:48:20.210Z"
    },
    "Horror House": {
        "author": "rui",
        "artist": "rui",
        "description": "Kazuko is an orphan with big culinary dreams. One day, she inherits a restaurant from a distant relative with one condition: she must live in the accompanying mansion. The catch? It's haunted! With the help of her new ghost friends, Kazuko works toward her dreams and discovers the meaning of family.",
        "slug": "1314",
        "cover": "https://static.manta.net/2021-10-27/ul/ulVZzfL7LDQ3OF29.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T05:51:21.904Z"
    },
    "Oversized Love": {
        "author": "Mingda",
        "artist": "Mingda",
        "description": "Hayan Yoon, a 17-year-old aspiring model, has been single her entire life. She believes her soulmate is out there, waiting for her. Then along comes a boy — a whole head shorter than her! — and suddenly, her world is pink and blooming with flowers. Could this be destiny?",
        "slug": "1406",
        "cover": "https://static.manta.net/2021-07-30/PS/PS2vOjz2JA8eZBl6.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-01-10T08:39:16.813Z"
    },
    "The World Ends at the Jump": {
        "author": "Neoul Sim",
        "artist": "Kwonsam",
        "description": "Hyunhee starts a new job as a server developer at a budding game company. As she digs deeper into a mysterious bug where if a player makes the character jump 65,536 times, the server shuts down, what shocking truths will she uncover? It's just a game... right?",
        "slug": "1136",
        "cover": "https://static.manta.net/2020-12-10/Qn/QnzaHBLgEvfkIcND.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T08:26:41.102Z"
    },
    "My Lovely Two-Two": {
        "author": "Gobang",
        "artist": "Gobang",
        "description": "After Dongho is left stuck with a dog he never wanted, something strange starts happening to him. The dog is actually a human?! How will Dongho live his daily life with a dog that only he can see is a naked young man?",
        "slug": "1117",
        "cover": "https://static.manta.net/2021-02-19/Sx/Sxg7AzXynCkUJRoi.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-31T15:57:11.121Z"
    },
    "Running Family": {
        "author": "Jiyeong Kang",
        "artist": "Cots",
        "description": "\"Running Family\" is a game where you get to pick the characters to run along different stages. The catch is that the characters in the game are actual people. When a character dies, they disappear from reality as well. Meanwhile, a strange hole appears. Although it swallows certain people, it is invisible to others. How could this mysterious hole be linked to the game? ",
        "slug": "1130",
        "cover": "https://static.manta.net/2020-11-19/1t/1t7e6WsJPunfdn7B.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T08:22:39.552Z"
    },
    "Happy Birthday": {
        "author": "Summer",
        "artist": "Summer",
        "description": "Going on with our lives after having lost someone is always painful. What does it mean to move on without forgetting them? This is a story about survivors struggling to find happiness within their guilt and grief.",
        "slug": "1240",
        "cover": "https://static.manta.net/2021-04-16/Bi/BiGRH19mDQHAlNHS.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T05:40:51.586Z"
    },
    "Evangeline's Sword": {
        "author": "SJ",
        "artist": "Manta Comics",
        "description": "Not a day goes by that Eve doesn't wish to reunite with her childhood friend, Mikha. But three years later, when she learns that Mikha has become a cursed sorcerer who leaves only death in his wake, Eve must embark on a journey to save not only the man she loves but also the world as she knows it.",
        "slug": "1830",
        "cover": "https://static.manta.net/2022-06-10/K8/K8c7hSOnIkLHh2rf.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-10T15:45:47.357Z"
    },
    "Your Eternal Lies": {
        "author": "Kkomak",
        "artist": "Kkomak",
        "description": "Infamous jailbreaker Rosen Walker has finally been transferred to the Isle of Monte, notorious for its maximum-security prison. Her guard? None other than Ian Connor, the beloved war hero of the empire himself. Now he must uncover the truth: is she really a murderer? Or is there more to the story?",
        "slug": "1909",
        "cover": "https://static.manta.net/2022-06-28/vK/vK28JrsRyxjiJiHb.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T09:26:27.801Z"
    },
    "Unbreakable Master": {
        "author": "Jeon, Yu-ho",
        "artist": "Jeon, Yu-ho",
        "description": "Naru has always believed he was cursed — whatever he touches breaks. But when a glass-shattering incident leads to a twisted encounter with a man who has supernatural powers, Naru begins to realize there's a world beyond his own where unimaginable powers exist...",
        "slug": "1390",
        "cover": "https://static.manta.net/2021-08-13/Sn/SnVFNoaO84sUBvVM.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T06:52:18.178Z"
    },
    "The Accidental Heiress": {
        "author": "doggo",
        "artist": "doggo",
        "description": "Florist Riella never meant to catch the attention of Duchess Horssen with her shining flowers, and she certainly didn't mean to inherit her entire fortune! So when the enraged Grand Duke Hann appears before her to claim possession of the inheritance, what is she to do? Can she defend her newfound title?",
        "slug": "1770",
        "cover": "https://static.manta.net/2022-06-03/Se/SejGearB0nW2Nle3.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T01:37:40.469Z"
    },
    "Legend of the Fitting Room Watchman": {
        "author": "Muhwa",
        "artist": "Sugeun",
        "description": "Jaeho is a genius but receives little recognition. He opens a clothing store, unaware that the building he rents is hiding a secret portal to another world! One day a man emerges, speaking in tongues. How does he know Jaeho’s name? Where is he from? Most importantly, what does he want with Jaeho?",
        "slug": "1817",
        "cover": "https://static.manta.net/2022-05-26/h7/h7X0cXNMuXpUXVGp.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-10T07:39:41.025Z"
    },
    "Hanyang Diaries": {
        "author": "Greeny Shadow",
        "artist": "STUDIO JEMI",
        "description": "Mystery and romance take Cheongdam, the owner of a trendy shop in the middle of Joseon's hottest new area, by storm! Will she be swept off her feet by the dashing Eul Jiro, or his friend, the mysterious Yi Taewon?",
        "slug": "1323",
        "cover": "https://static.manta.net/2022-01-19/Eo/EoETteF8gQn4MHXH.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:27:26.665Z"
    },
    "Justified Murder": {
        "author": "Gwanyu Kim",
        "artist": "JEM, Seungshin Kwark",
        "description": "Dr. Seowoo Han is targeted for revenge and ends up killing her attacker in self-defense. Her detective husband helps her dump the body and frame it as the work of a serial killer. The only problem? The real serial killer knows what they did, and is blackmailing them into committing more murders...",
        "slug": "1263",
        "cover": "https://static.manta.net/2021-10-15/3n/3nqC7xRG8PsCHuPJ.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-10T02:30:00.010Z"
    },
    "Log in to Love City": {
        "author": "Nakyung",
        "artist": "Kangkyeol",
        "description": "Narae doesn’t really believe in love. BBQ restaurant owner by day and romance novelist by night, she’s too busy with work to pursue a relationship. When she gets a strange text that offers her the chance to find true love, she accepts it as a joke - until she actually ends up in a game. Will she be able to escape.. and find true love along the way?",
        "slug": "1291",
        "cover": "https://static.manta.net/2021-02-22/b9/b9tohHzWzkSb5UAc.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-07T16:01:58.873Z"
    },
    "Stargazing": {
        "author": "Gyobi",
        "artist": "Gyobi",
        "description": "When his friend Byeol confesses that he likes someone else, Junseo is more confused than ever about his own feelings. While lost in thought, he's suddenly dragged off by a new \"Mr. Byeol\" to the oddest club on campus. Can this new star finally put a twinkle in Junseo's eye?",
        "slug": "1714",
        "cover": "https://static.manta.net/2022-04-27/cn/cnrgkH4jAPMk2Hgu.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T02:32:41.121Z"
    },
    "Three's a Crowd": {
        "author": "PIL",
        "artist": "Ranunculus",
        "description": "Yeonwoo's girlfriend, Jiyeon, leaves him without explanation. In a cooking class, Yeonwoo meets a new friend who happens to be Sujin - a higher up at the company he is interning at. All seems well at first, but what happens when Sujin falls in love with Jiyeon?",
        "slug": "1180",
        "cover": "https://static.manta.net/2020-11-19/q6/q6MmBtfbeAcuPwzP.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:48.627Z"
    },
    "Salvation": {
        "author": "Gwendolyn",
        "artist": "Dojin",
        "description": "After falling into an icy pond, Minhu wakes up in an unfamiliar world. He soon realizes he's the prophesied hero who's supposed to bring salvation to Ubrade by marrying Emperor Sioen. Will Minhu find his way back to earth? Or will he accept his destiny as the savior?",
        "slug": "1457",
        "cover": "https://static.manta.net/2022-05-24/CR/CRs8QlsbVgZ9YBpF.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T05:55:17.847Z"
    },
    "The Shape of Sympathy": {
        "author": "Nodeok",
        "artist": "Nodeok",
        "description": "Yuri attends the wedding of his unrequited love. There, he runs into his former homeroom teacher Seonwoo, who seems just as heartbroken by the union. But little does he know that Seonwoo's tears are meant not for the bride, but for the groom...",
        "slug": "1254",
        "cover": "https://static.manta.net/2022-04-15/bR/bREwTONQq842Nsjd.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:32:18.165Z"
    },
    "Talk to Me": {
        "author": "Gwanyu Kim",
        "artist": "MIBO",
        "description": "Youngjun Kim has a stutter due to a traumatic incident from his past. A girl from his childhood shows up again in his life. Together they learn to enjoy their everyday lives, fully embracing their individual challenges as theme park cast members.",
        "slug": "1139",
        "cover": "https://static.manta.net/2020-12-11/1Q/1QPhY722Lxnfa9cG.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T08:26:48.196Z"
    },
    "Lost You Forever": {
        "author": "Piao Shu",
        "artist": "zerd|Yun Xiaoliu",
        "description": "Wen Xiaoliu is a local physician. When he stumbles upon a man on the verge of death, he treats him and gradually nurses him back to health. The grateful patient swears allegiance to Xiaoliu and accepts his new identity as Ye Shiqi, Xiaoliu's servant. Slowly, their true identities are revealed...",
        "slug": "1847",
        "cover": "https://static.manta.net/2022-06-15/7T/7TU3Dtx1cnq29Pal.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-04T08:04:51.113Z"
    },
    "One Kid, Two Dads": {
        "author": "Nakyung",
        "artist": "Kyungseok",
        "description": "Doting father Sungsil suddenly discovers his wife is a gangster and their son isn't actually his! The real father, actor Seungheon Kang, reclaims his child but soon realizes he can't handle the constant wailing. Can these two men find a way to work together and raise little Hyunwoo?",
        "slug": "1319",
        "cover": "https://static.manta.net/2021-06-23/Cj/CjzUHFNwskcvbeNq.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-25T07:17:57.510Z"
    },
    "Bongchon Bride": {
        "author": "Sohn Gaepi",
        "artist": "Sohn Gaepi",
        "description": "Soongap is nearly beaten to death by his master when friendly giant Bongchun buys him and saves his life. Bongchun's blind mother is delighted, believing her son has finally brought home a bride. And the more Bongchun treats Soongap like his darling bride, the more things get heated...",
        "slug": "1293",
        "cover": "https://static.manta.net/2022-07-07/Cz/CzAndLGxwASIR2pN.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T03:35:56.922Z"
    },
    "The Script": {
        "author": "NINA",
        "artist": "NINA",
        "description": "To reverse a curse put on her and her brother, Yeju has been searching for the shaman responsible for 13 long years. When the heir to the Tiger Clan, Heewu, sets Yeju up in order to steal her sword, the two realize that they have the same objective. But is this new man friend or foe?",
        "slug": "1774",
        "cover": "https://static.manta.net/2022-05-01/nN/nNofM5I03CN6cBx1.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-29T06:47:32.770Z"
    },
    "Michelin Star": {
        "author": "Song",
        "artist": "Song",
        "description": "Aspiring chef Taehwan Ryu dreams of earning the first Michelin star in Korea, even turning down a job offer from a renowned restaurant in France. Meanwhile, Eunbi Park, the owner of La Petit Maison, a restaurant in Korea, is clueless to her restaurant’s waning quality. What will happen when Taehwan decides to intervene in La Petit Maison’s kitchen?",
        "slug": "1160",
        "cover": "https://static.manta.net/2021-02-19/c5/c5ULSiknepw7oXQT.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-21T07:37:08.499Z"
    },
    "Mom, I'm Gay": {
        "author": "Boreum",
        "artist": "Boreum",
        "description": "Jin and Rin are best friends, and they each have a secret - they are both gay. Life turns upside down when both of their households find out about their sexual orientation. How will they survive despite their parents knowing?",
        "slug": "1118",
        "cover": "https://static.manta.net/2021-01-29/v8/v81W57bBYL8h5lCK.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-31T15:57:20.608Z"
    },
    "The Secret of Umbra": {
        "author": "Jamsino",
        "artist": "Jamsino",
        "description": "When Gabriele is forced to move away from his city life to a rural town in Italy, he is determined to hate everything about Umbra. The town's so old, and everyone his age looks miserable. He's never gonna adjust, and he's gonna miss his big city life. Except, there's a mystery here — one of love.",
        "slug": "1855",
        "cover": "https://static.manta.net/2022-05-27/g8/g8zwdnyCnk02p08q.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-29T15:40:42.463Z"
    },
    "Secondo Piatto": {
        "author": "bestrestaurant",
        "artist": "bestrestaurant",
        "description": "Hyunwook is a coward when it comes to his longtime crush Heesun, who suddenly announces that she’s getting married. He helps her plan her wedding at a restaurant called Secondo Piatto. There he meets Wonyoung, an old friend of Heesun’s fiancée. But why is Wonyoung crying on the day of the wedding?",
        "slug": "1687",
        "cover": "https://static.manta.net/2022-03-14/6v/6viTdaR4X0Mr9Cex.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:38:42.497Z"
    },
    "Restoring Art and Love": {
        "author": "SigolGae",
        "artist": "MEE, Hyeon",
        "description": "Sunah, the daughter of a rich family, is trying to transform her mother's failing art museum. She soon encounters art restorer Inho, who disagrees with her methods. As he tries to convince her that restoration is often better than a complete do-over, the two begin to fall in love.",
        "slug": "1785",
        "cover": "https://static.manta.net/2022-02-18/aI/aIcsu6utgQbB08rZ.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-18T16:44:40.856Z"
    },
    "The Keystone Romantic Combination": {
        "author": "Teava",
        "artist": "TEAL",
        "description": "Youngjoon, a bitter third-rate baseball player, hates everything about top player Hyun, from his natural talent to his good-natured personality. Meanwhile, Hyun has had a crush on Youngjoon for 7 years and has no shame in showing his feelings, openly chasing after him. What will happen when the two somehow end up on the same team? ",
        "slug": "1196",
        "cover": "https://static.manta.net/2021-02-15/dx/dx0V2jNf23heqhGA.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:30:42.658Z"
    },
    "Spring, the Color of Love": {
        "author": "Jiyeon Park",
        "artist": "Jiyeon Park",
        "description": "Cheongsun and Gonghyeon meet as college students, but their differences in station and experience lead to a painful falling out. Ten years later, the two meet again in the world of hotel management and get to reminiscing about their short spring love all those years before...",
        "slug": "1325",
        "cover": "https://static.manta.net/2022-01-10/BT/BTxX51Yz5THV35EQ.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:34:26.493Z"
    },
    "How to Avoid a Debut": {
        "author": "Gongsoogyodae",
        "artist": "Jungeun",
        "description": "Hahyeon is a dancer who's just graduated high school. At the desperate request of his producer uncle, he ends up participating in Survival ID, an idol audition program. The plan was to have him eliminated early on, so how is he making it through every stage?!",
        "slug": "1281",
        "cover": "https://static.manta.net/2021-03-28/Cv/Cv9ObCm3trXUepw7.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-01-02T08:16:23.189Z"
    },
    "Back Through Time": {
        "author": "Gam-yeong Ryu",
        "artist": "Gam-yeong Ryu",
        "description": "In a world where sorcerers are hunted down, Latte must hide her special powers as she attends school away from home. Without her father, she finds that her control over her powers is wavering. Will she be able to hide the powers that she is still trying to tame? ",
        "slug": "1175",
        "cover": "https://static.manta.net/2021-03-16/aa/aa7umCAntJvxsI8B.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:48.506Z"
    },
    "NPCs Can Save the World Too!": {
        "author": "Poppypari",
        "artist": "Poppypari",
        "description": "We've all read those stories—the protagonist has a terrible accident but then comes back as a key character in a fantasy novel— and so has Lucian. Imagine his surprise when he gets into one then is reincarnated in a fantasy game he's played as... an NPC! He's supposed to change the fates, but how?!",
        "slug": "1697",
        "cover": "https://static.manta.net/2022-04-30/ok/okvqUuJOpwhMJnmy.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-04T23:05:33.721Z"
    },
    "A Zero Waste Life": {
        "author": "Ehreun",
        "artist": "Ehreun",
        "description": "After relying on fast food and alcohol for too long, a health scare pulls our heroine into the world of \"Zero Waste.\" But her attempts to improve her own health, as well as the health of the planet, start causing issues with the people around her. Is living a zero waste life really possible?",
        "slug": "1711",
        "cover": "https://static.manta.net/2021-12-01/ZZ/ZZNaTb5CVhIWwPh1.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-07T08:26:08.179Z"
    },
    "When the Flowers Bloom": {
        "author": "Cho Doo Jin",
        "artist": "Manta Comics",
        "description": "Eungtae, a man destined to die young. Yeon, a woman whose childhood was cursed by the heavens. On a precious summer day beneath the blossoms of the trumpet vine, the two fall in love as fate intended. And in an instant, a shadow is cast over their future.",
        "slug": "1723",
        "cover": "https://static.manta.net/2021-12-01/3P/3PcHunxaJ4aDR5px.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-10T02:41:42.639Z"
    },
    "A Nonsense Relationship": {
        "author": "Space Dust",
        "artist": "Jam B",
        "description": "Youngjin is devastated after being rejected by his fellow teacher and friend. To soothe his broken heart, he drinks the night away and ends up having a one-night stand with Sanghyun, a hot guy he meets at the bar. Little does he know that Sanghyun is the father of his new student!",
        "slug": "1335",
        "cover": "https://static.manta.net/2021-06-23/9H/9HiLDE86UOoPu5KP.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T04:28:47.682Z"
    },
    "Lady Devil": {
        "author": "B. cenci",
        "artist": "FUKI Choco",
        "description": "In hopes to escape a forced marriage, Giovinetta makes a wish to the devil to save her, but what she doesn't know are the consequences of her actions. Read the steamy story of a girl who just wants to be with the one man she is forbidden to love.",
        "slug": "1165",
        "cover": "https://static.manta.net/2022-01-27/OA/OA22n0wtjFlSIk2d.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-06T08:45:59.593Z"
    },
    "The Stand-In": {
        "author": "Neoul Shim",
        "artist": "IC",
        "description": "Doyong was a child star when he was six. But now at the age of 20, he's just another unknown theater actor. Then a big-shot production company comes to him with an offer:\n\"We're just going to borrow your name and your face. CGI will do the rest.\"\nAfter that, Doyong's life begins to change...",
        "slug": "1232",
        "cover": "https://static.manta.net/2021-01-09/n7/n71HWgD1LomhVLUN.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T14:28:59.942Z"
    },
    "Seducing the Jerk": {
        "author": "Mila",
        "artist": "Seoh",
        "description": "Eunsung has always been genetically blessed in the looks department. But what happens when his good looks catch the attention of a ghost? And what will he do when the ghost refuses to pass on till Eunsung helps him get revenge on his first love... by turning him gay?!",
        "slug": "1780",
        "cover": "https://static.manta.net/2022-01-14/M1/M13B6JQDWuDZCq6K.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:44:41.074Z"
    },
    "Love Lies": {
        "author": "Setbyul Park",
        "artist": "GGuyo",
        "description": "Being the manager of a popular actress is not very fun. Hyojung is stuck on the sidelines running errands for Yeonkyung, the popular actress who also happens to be Hyojung's cousin. But Yeonkyung makes an interesting proposal: “Help me date Seungyun, Korea’s hottest star.” What will happen when Hyojung and Seungyoon begin a fake relationship to get back at Yeonkyung? They're just faking it, no emotions involved... right?\n",
        "slug": "1277",
        "cover": "https://static.manta.net/2021-06-07/Hp/Hpcmc9Os1GI7wux7.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T12:19:02.610Z"
    },
    "Mango's Bone": {
        "author": "Gold Kiwi",
        "artist": "Tired Vagabond",
        "description": "Jooin has the perfect life -- perfect grades, a successful father, a supportive family. Stuck in his own perfect world, he doesn’t understand why his twin brother Jooyul doesn’t care about school, or why Lisa, his classmate, seems to hate her grandmother. As he grows closer to his classmates, he learns that the world might not be as clear-cut as he thinks.",
        "slug": "1185",
        "cover": "https://static.manta.net/2021-02-19/ad/adCY3VRlZ1fXRbpX.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:49.423Z"
    },
    "Sora's Eyes": {
        "author": "Summer",
        "artist": "Summer",
        "description": "Sora has descended from the mountains to guard the sickly Jungha. The two have a set of rules to guide them: One, Sora decides what is considered an emergency. Two, Jungha must listen to Sora in an emergency. Three, Jungha must not bully Sora. Will they be able to stick to them?",
        "slug": "1221",
        "cover": "https://static.manta.net/2021-03-15/oG/oGCaSfWiZOS2SbUl.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T04:59:38.607Z"
    },
    "The Choice": {
        "author": "Lee Eumsae",
        "artist": "Green Bi",
        "description": "A miraculous, 1-in-200,000 chance birth of conjoined twins. The probability of their survival? Less than 5%. Born with just one heart between the two of them, the Kang sisters face a sinister fate: for one to survive, the other must die. Their mother faces a horrible choice. How would you decide?",
        "slug": "1247",
        "cover": "https://static.manta.net/2021-07-27/ES/ES0kIhp6B4OLLm7c.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-08T07:42:28.081Z"
    },
    "Broken Melody": {
        "author": "Ijae",
        "artist": "Ijae",
        "description": "Minhee, a fallen piano prodigy, has lived her life with pain and trauma ever since a single mistake ruined her family and any chance of playing the piano again. Hyun is a piano teacher who is equally haunted by his own life mistakes. What will happen when they meet as teacher and student? Will it be a chance at redemption? Or will it bring about even more destruction? ",
        "slug": "1206",
        "cover": "https://static.manta.net/2020-12-09/oC/oCtEJWQwIoZ5v6Up.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:51.875Z"
    },
    "His House": {
        "author": "Hajin Yoo",
        "artist": "Hajin Yoo",
        "description": "Gangyoo Lee, a college student strapped for money, is working at a boyfriend rental service. Suddenly, he receives a strange boyfriend rental request from a mysterious rich client called Soohyun Yoon who is crippled in a wheelchair. They don't get along, yet Soohyun keeps Gangyoo around. Why did Soohyun hire him? What could he be hiding?",
        "slug": "1195",
        "cover": "https://static.manta.net/2020-11-19/9A/9AHpPxbiFqK90M92.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:50.303Z"
    },
    "I Choose the Emperor Ending": {
        "author": "SUO KIM",
        "artist": "Jaradog",
        "description": "Genius scientist Marina has created her own medieval VR game. Soon after entering, however, a glitch prevents her from leaving. To make matters worse, she's quickly picked up by a slave trader! Her only chance of survival rests in the hands of the game's handsome male protagonist, Edward.",
        "slug": "1746",
        "cover": "https://static.manta.net/2022-03-18/XA/XAD9RVs7k7vK2WEn.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-03-18T07:17:44.773Z"
    },
    "The Live": {
        "author": "Ant Studio",
        "artist": "Seongmoo Hur",
        "description": "Yoonjae leads an empty life after his wife and daughter are brutally murdered. One day, his journal reveals one mysterious sentence: “You can see them again.” Yoonjae is pulled into a parallel universe where everyone is a player in a lethal game, and the final survivor will be granted any wish. Desperate to be reunited with his family, will Yoonjae succeed in fighting his way in this hellish world to be the last one standing?",
        "slug": "1250",
        "cover": "https://static.manta.net/2022-05-06/ij/ij3nzFObXbtnE0qW.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-24T01:06:55.458Z"
    },
    "The Dark Night Journal": {
        "author": "You Gui",
        "artist": "Nini Duck",
        "description": "In Victorian London, where people are beginning to enjoy the achievements of their forefathers and the luxuries of life, there exists a mystical bond between special individuals known as sentinels and guides. As a string of murders threatens the city, how will Lance track down and fight these killers?",
        "slug": "1454",
        "cover": "https://static.manta.net/2021-12-01/fj/fjXf9KYpf7eFeJp8.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-10T09:21:42.728Z"
    },
    "Vampire Beru & Ghost Aki": {
        "author": "Humiko",
        "artist": "Humiko",
        "description": "All Beru wants is a friend, but being a vampire means he's forever alone. After venturing out one Halloween, however, he meets a ghost named Aki. Their worlds collide, and they begin to form a bond like no other.",
        "slug": "1455",
        "cover": "https://static.manta.net/2021-09-09/xC/xCaGEoGqscvAX1VC.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T05:05:13.178Z"
    },
    "The Scarecrows": {
        "author": "Myeongeun Bae",
        "artist": "JEM",
        "description": "Mr. Kim has lived alone ever since his wife mysteriously fell off a cliff. Her body was never found, and Mr. Kim believes that she is still out there. On a dark, pouring day, Mr. Kim revisits the site of her presumed death. On his search for her, he comes across an old man that creates scarecrows for \"souls\"...",
        "slug": "1133",
        "cover": "https://static.manta.net/2020-11-19/IE/IEYXo0ZQD06yMvzy.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T08:25:55.644Z"
    },
    "The Director Who Buys Me Dinner": {
        "author": "Toesa",
        "artist": "Eunji Yang",
        "description": "Dongbaek is one of the newest employees at Min Entertainment. His director, Yudam, is absolutely perfect in every way. Yet, Dongbaek thinks his director has lost his mind... What do you mean the director has lived three lives? What do you mean they have to date if they don't want to die? ",
        "slug": "1159",
        "cover": "https://static.manta.net/2021-11-01/sB/sB8o44vGqAiX0lHB.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T02:04:15.570Z"
    },
    "Follow the Bread Crumbs": {
        "author": "Gyeoni",
        "artist": "Gyeoni",
        "description": "I possessed Yielle Frank, the witch from Hansel and Gretel! I didn't want to die like in the original story, so I took good care of the children and sent them off. But ten years later, Hansel returns, all grown up... \"Am I still just a kid to you? Please don't run away.\"",
        "slug": "1285",
        "cover": "https://static.manta.net/2021-08-05/hB/hBabz4ltuqneGaI6.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T05:10:26.404Z"
    },
    "Being Me, Being You": {
        "author": "Chanhoo",
        "artist": "Chanhoo",
        "description": "Hyeonjung, a physiotherapist, dreams of drawing comics despite her family constantly putting her down. Her boyfriend Seulgi is a successful cartoonist, but he can't stand it when he finds himself in a rut while Hyeonjung matures and evolves. The two find themselves on the way to splitting up...",
        "slug": "1800",
        "cover": "https://static.manta.net/2022-03-30/sJ/sJfZp4nkfKVsAPKm.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T03:31:35.858Z"
    },
    "Tendering Resignation": {
        "author": "Yeon-hui Woo",
        "artist": "Daman",
        "description": "Geumhee has always felt safe and comfortable working at her best friend Taeri's company. But everything changes when Bora comes and stirs things up — Taeri suddenly goes into hiding, and Geumhee gets thrown into the middle of... a police investigation and a messy lesbian love triangle!",
        "slug": "1273",
        "cover": "https://static.manta.net/2021-08-05/AN/ANtbGwnXpLUGcuCg.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-26T03:42:44.982Z"
    },
    "The Tale": {
        "author": "YANG-CHUL-DJ",
        "artist": "YANG-CHUL-DJ",
        "description": "A murderer by the alias “The Tale” is on the loose, and he uses fairytales to manipulate others into kidnapping and killing his victims for him. Five missing women. Five mysterious invitations. One party. Will the unlikely duo of elite detective and playful author be able to work around their differences to get to the bottom of the case? ",
        "slug": "1138",
        "cover": "https://static.manta.net/2020-11-19/mD/mD5VjJKqtwaGycSr.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:56.788Z"
    },
    "Goodbye, Dieting!": {
        "author": "Kimgae",
        "artist": "Nawoon Im",
        "description": "There are countless ways to diet. So why are there no ways to quit? An intimate, cheerful tale of growth about a woman who has long struggled with body image issues and eating disorders.",
        "slug": "1289",
        "cover": "https://static.manta.net/2021-03-07/uN/uNiG6lQPbwRuF2Lq.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T02:47:15.702Z"
    },
    "Summer Letter": {
        "author": "Miwool",
        "artist": "Areum",
        "description": "With the lousy excuse that she made a bet with her friends, Boye storms into the life of quiet, model student Taebom, demanding that he act the part of her boyfriend. Little does he know however, that Boye has had her eye on him for quite some time...",
        "slug": "1396",
        "cover": "https://static.manta.net/2022-05-05/Qy/Qydx4SHaacoHMN5g.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:27:51.451Z"
    },
    "Recipe for Love": {
        "author": "OMATO",
        "artist": "Lim",
        "description": "Washed-up singer Rosa is at the end of her rope. She's jobless, her agency's just about given up on her, and her boyfriend is a deadbeat. But what happens when she's suddenly invited on to the reality show Celeb Kitchen Battle? And how will she react to meeting her one true love?",
        "slug": "1769",
        "cover": "https://static.manta.net/2022-02-18/5g/5gOQhb7TELhR9LXR.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T02:29:25.178Z"
    },
    "Words & Kisses": {
        "author": "Sehee Kim",
        "artist": "Mockma",
        "description": "Just as I was about to get into another ambiguous, half-hearted relationship, I met her. Hyunjin Go. I couldn't take my eyes off her. I had been treading a dull path, and she knocked me right off. Then I felt it — a little piece of my heart, breaking off and slipping away. \"She's so pretty...\"",
        "slug": "1229",
        "cover": "https://static.manta.net/2020-12-15/Sr/SraoaklQcSDurGEk.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T08:26:54.973Z"
    },
    "Eye Contact": {
        "author": "Leesoo",
        "artist": "Leesoo",
        "description": "If the Internet were to disappear tomorrow, what would you do? When the \"Digital Wipeout\" prevents access to digital data on a global scale, the Koos are faced with this exact predicament. Now, this family of social media addicts will have to put down their phones and really connect — face to face.",
        "slug": "1459",
        "cover": "https://static.manta.net/2021-11-24/nK/nKc3oVE7zul6cs8y.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-01-08T08:22:51.143Z"
    },
    "Pound of Flesh": {
        "author": "Seoh Nam",
        "artist": "seogeul",
        "description": "A world where people share their flesh. I give mine to others, and they carve a piece for me. It's toxic corporate culture on another level — how long could you last in a workplace like this?",
        "slug": "1233",
        "cover": "https://static.manta.net/2021-02-19/bc/bcsUZuLcUlrT7Nyl.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T14:29:26.584Z"
    },
    "Check In to My Heart": {
        "author": "p.cong",
        "artist": "p.cong",
        "description": "Ajin, the newest intern at the ritzy HU Hotel, seems to have it all: looks, intelligence, and money. But when Seolmin, the CEO, discovers that she's living in the basement of his hotel, Ajin desperately makes a deal with him to avoid getting kicked out. But this deal might change her life forever!",
        "slug": "1777",
        "cover": "https://static.manta.net/2022-04-27/MV/MVSNgjGgSELS0ra6.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-11T13:44:20.288Z"
    },
    "My Ex, Client": {
        "author": "Hera Kang",
        "artist": "Sujin Kim",
        "description": "Jihyo was already having a bad day on her way to work. But like a bad omen, she then meets her ex-boyfriend as a big client! After a bad breakup, she doesn't want anything to do with him, but he is determined to get her back. What does Jihyo's ex-boyfriend want and why did he decide to show up now?",
        "slug": "1143",
        "cover": "https://static.manta.net/2022-03-18/Zi/ZiLWywoiOzxeNUyp.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:47.574Z"
    },
    "Love & Wish": {
        "author": "Ine",
        "artist": "Ine",
        "description": "17-year-old Daeun has always been a hopeless romantic. When she moves into a new apartment in Seoul, she falls head over heels for her handsome neighbor. Turns out, they're classmates, so it has to be destiny, right? But could he really be her Prince Charming? Or is he hiding a dark past?",
        "slug": "1177",
        "cover": "https://static.manta.net/2021-02-19/nE/nE4yIa8TKcyM3yE8.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-25T05:31:15.281Z"
    },
    "One Step Away From Happiness": {
        "author": "Byeok Gong-woo",
        "artist": "Byeok Gong-woo",
        "description": "Bina and Heewoon have known each other since childhood. Now a third-year resident at Hyemun Hospital, she's shocked when he suddenly confesses his feelings for her. The problem? Their 10-year age gap! Will Bina be able to overcome her confusion and get one step closer to happiness?",
        "slug": "1729",
        "cover": "https://static.manta.net/2021-11-19/6N/6NPTaRaT1jwK6UGa.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T00:54:26.425Z"
    },
    "Prequel Romance": {
        "author": "Haejeo500M",
        "artist": "Eunbi",
        "description": "Taejin has it all – looks, talent, fame, money – everything except a decent personality! With his reputation on the line, Taejin gets sent to work in a factory for a movie that will save his career. But will he be able to survive a life of hard labor under the beady eyes of factory chief Hasung?",
        "slug": "1803",
        "cover": "https://static.manta.net/2022-04-19/nK/nK7Ls1t8oUOGUH2A.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:45:20.332Z"
    },
    "From Bread to Closets": {
        "author": "Raehyeon Kim",
        "artist": "Raehyeon Kim",
        "description": "Jinsoo is a hoarder, Haeyoung a minimalist. But together, they make the perfect team! After meeting at a bakery as boss and employee, the two start visiting their customers' homes to help them organize their closets and rediscover themselves in the process.",
        "slug": "1331",
        "cover": "https://static.manta.net/2021-05-11/HJ/HJX8RM1NYg26ykbW.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T02:47:36.995Z"
    },
    "Cheoyong: A Ghostly Romance": {
        "author": "Yoonmi Lee",
        "artist": "Moyun",
        "description": "Jaehee, who has been able to see ghosts his entire life, will do anything for money. So he doesn't miss an opportunity when he hears of Cheoyong, the ghost able to grant any and all sorts of fortunes. Instead, what he finds is a sleepwalking girl possessed by Cheoyong... What is this all about?",
        "slug": "1164",
        "cover": "https://static.manta.net/2021-04-21/v4/v4OgUgo7ZplLdWFb.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T05:30:36.799Z"
    },
    "Eyes Closed": {
        "author": "Lee Seunghwan",
        "artist": "Lee Seunghwan",
        "description": "Hyunwoo makes a living busking in subway stations. Turns out being blind makes people a lot more generous — and a lot more confiding. But when a strange man approaches him with a secret of his own, Hyunwoo is suddenly entangled in a murder case, turning his life upside down.",
        "slug": "1393",
        "cover": "https://static.manta.net/2021-10-01/5v/5v3sBlUbnsm1F1Gj.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-22T03:35:50.023Z"
    },
    "The Greatest Blunder": {
        "author": "Double Star History",
        "artist": "Dong",
        "description": "\"Obey my orders! Do not question me!\" Set during World War II, one of the greatest disasters in the history of humankind — this is the dramatic story of those whose blunders changed the course of history.",
        "slug": "1217",
        "cover": "https://static.manta.net/2021-02-22/I6/I6g9DXVRwDfyj1Ir.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T02:46:30.406Z"
    },
    "Horns, Horns Everywhere!": {
        "author": "Nazee",
        "artist": "Nazee",
        "description": "As a carrier of the “Minotaur Syndrome,” Noon has the antlers and head of an animal. He finally manages to land a job, only to find his new office covered in foliage and the other employees with the same condition as him! Will he be able to make it through this new chapter in life in one piece?",
        "slug": "1458",
        "cover": "https://static.manta.net/2022-02-18/QK/QKF3zzGgoqGglrZQ.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:28:19.663Z"
    },
    "Nowhere But Iceland": {
        "author": "Yeondu",
        "artist": "Green Dew",
        "description": "Feeling like a failure after giving up her lifelong dream, Kkangjang travels to Iceland, a country where failure is embraced — and also one of the most expensive places in the world. Can she make her journey work on a shoestring budget? Follow along as she travels with the help of a guardian spirit!",
        "slug": "1824",
        "cover": "https://static.manta.net/2022-05-19/9e/9eBTg1EENdWXJqEl.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T03:56:22.820Z"
    },
    "My Dear Maid!": {
        "author": "SpringIsComing",
        "artist": "BORI",
        "description": "Kate knows full well that orphan girls don't get fairy tale endings. But when she saves the kidnapped daughter of Count Blanc, she's given the opportunity of a lifetime: becoming a maidservant at the Blanc Estate. There, she meets Alex, the cold but dashing heir whom she mistakes as a priest...",
        "slug": "1750",
        "cover": "https://static.manta.net/2022-01-12/CE/CEHY3YmUAF7cC4yS.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T09:58:10.118Z"
    },
    "My Uncle Is a Superstar": {
        "author": "Huh Wonjin",
        "artist": "Nopni",
        "description": "Forced to give up on his dreams of being a singer to look after his mom and niece, Woojin finds himself in a slump. Then one day, he receives an AI robot that claims it will help him realize his dreams. From struggling carpenter to worldwide superstar — will Woojin finally get his shot?",
        "slug": "1450",
        "cover": "https://static.manta.net/2021-07-27/SX/SXluMOJ7v7va2uSW.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T05:09:17.854Z"
    },
    "How to Make Friends and Win Love": {
        "author": "Juhyung",
        "artist": "Juhyung",
        "description": "Desperate to charm his crush, shy Taeoh buys a copy of How to Win Friends and Influence People. To his shock, the book's spirit pops out and starts giving him advice, and he sees a flicker of hope. Follow Taeoh as he learns the art of love, friendship, and social skills from a wise old fox spirit!",
        "slug": "1801",
        "cover": "https://static.manta.net/2022-05-24/Hp/HptRT3ZJ5KGpJ4Nk.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-01T03:39:27.446Z"
    },
    "Legends of the Nile": {
        "author": "Bohyun Kim",
        "artist": "Dooyong Jang",
        "description": "Horus lives the life of a vagabond until one day, the god of wisdom Thoth appears to him and reveals the truth: Horus is the son of Osiris, the rightful ruler of Egypt who was murdered by his own brother. Now begins his quest to avenge his father and reclaim his birthright as king of Egypt!",
        "slug": "1756",
        "cover": "https://static.manta.net/2021-12-10/BR/BRx5qh6wBUKiVpuL.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-09T01:23:10.229Z"
    },
    "Before It's Too Late": {
        "author": "Kion",
        "artist": "Kion",
        "description": "Seohee and Eunho have known one another for 15 years, and they've always been each other's top priority. Their relationship blurs the line between friends, family, soulmates, and lovers. But one day, it comes to a tipping point when Seohee suddenly declares, \"Eunho, I can't do this anymore.\"",
        "slug": "1409",
        "cover": "https://static.manta.net/2021-06-24/RV/RV41QVyGTK93axv0.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-26T04:54:58.980Z"
    },
    "The Maid and the Vampire": {
        "author": "Yujeong Ju",
        "artist": "Seon Lee",
        "description": "Areum Yoon, a normal high school girl, falls into a strange isekai world called 'Soltera' after an accident. She is sold as a slave to Millard Travis, a duke and the only vampire in the world. Desperate to survive, she swears to serve the cold-hearted Lord Millard as his personal maid. Will Lord Millard's attitude change with Areum's devotion to him?",
        "slug": "1192",
        "cover": "https://static.manta.net/2021-01-22/Fm/FmFw68WCpZOluTWt.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:49.535Z"
    },
    "As You Wish, Princess!": {
        "author": "Ryu ho",
        "artist": "Ryu ho",
        "description": "After Princess Lemon is saved by her prince, the two are headed straight for a happy ending...! Or so she thought. Poor Princess Lemon is once again left waiting for her Prince Charming. Will she ever succeed in her search for love?",
        "slug": "1388",
        "cover": "https://static.manta.net/2021-10-20/EU/EUozVmI7LjTNmUpB.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-01T03:26:27.622Z"
    },
    "The New Recruit": {
        "author": "Moscareto",
        "artist": "Zec",
        "description": "After spending his 20s getting over a crush, Seunghyun vowed to never give his heart to someone in the same field again. Enter Jongchan, Seunghyun's tough new boss with a surprising soft side. Will Seunghyun's first job and first relationship be a success?",
        "slug": "1318",
        "cover": "https://static.manta.net/2021-11-26/3F/3FMnz473lYAUpWDK.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-25T05:25:31.226Z"
    },
    "My Red String of Fate": {
        "author": "SHIN JI-SANG",
        "artist": "CUMIN",
        "description": "After getting sucked into a reverse harem novel, Leann enjoys her quiet life as a priestess in a temple. But things become twisted when the red string of fate irrevocably connects her to an injured man she heals — a man who just happens to be the worst villain in the story!",
        "slug": "1276",
        "cover": "https://static.manta.net/2022-02-18/I6/I67Wo5g7tznhS7dK.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-23T09:58:37.879Z"
    },
    "The Happening": {
        "author": "Inggun",
        "artist": "Inggun",
        "description": "Everyone's changing! For some reason, people are turning red and tearing each other apart like zombies. Meanwhile, Lee Park is a high school student with an empathy disorder who suddenly begins to experience emotions for the first time. Will he be able to survive amidst all the chaos?",
        "slug": "1290",
        "cover": "https://static.manta.net/2021-06-15/uF/uFv3nJOKFcbht8dL.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-02T03:03:01.939Z"
    },
    "I See You": {
        "author": "Pixel",
        "artist": "Pixel",
        "description": "Seowoo has just about had it with life. But when she's about to jump off a bridge, she's interrupted by a grim reaper nobody else can see. Not only that, the reaper wants her to stay alive for 3 more months! A woman who wants to die and a strange reaper — will Seowoo finally find a reason to live?",
        "slug": "1463",
        "cover": "https://static.manta.net/2022-05-24/ij/ijhzBz2DtldGhCrD.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T01:30:44.796Z"
    },
    "North x Northwest": {
        "author": "Noonal",
        "artist": "Yoonyang",
        "description": "It was all smooth sailing for Lil Schweiz, a famous pirate captain, until some shocking news almost threw her overboard. The notorious Admiral Retiro, known for scalping and feeding his pirate captives to flesh-eating fish, is on his way... And he's coming for one thing only.",
        "slug": "1315",
        "cover": "https://static.manta.net/2021-05-04/uj/ujCctiTFMD18VImf.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-10T08:19:30.610Z"
    },
    "Hello and Goodbye": {
        "author": "Woonipi",
        "artist": "Woonipi",
        "description": "Every night, I still picture Bangwool waking me in the morning, waiting by the door for my return, the two of us going out for night walks... But she's gone now, and all I have is grief and regret. She was more than a pet — she was family. I know she'd hate to see me so sad. But how do I move on?",
        "slug": "1461",
        "cover": "https://static.manta.net/2022-01-19/Wa/WaohkWNUn7NykUvT.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-13T16:30:50.466Z"
    },
    "W: Two Worlds": {
        "author": "Ju_niverse",
        "artist": "Lee Chae",
        "description": "Yeonjoo, the daughter of a famous cartoonist, is a student studying medicine at Hanguk University. On her birthday, after wishing for a man like her favorite comic character, Kang Chul, Yeonjoo wakes up in Kang Chul's world. Will Yeonjoo be able to find her way out of her father’s cartoon universe?",
        "slug": "1280",
        "cover": "https://static.manta.net/2021-10-15/I5/I5bG1bm4H0aZ410o.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:26:41.452Z"
    },
    "Behind the Logo": {
        "author": "Bumgeun Song",
        "artist": "Hajung Song",
        "description": "Remember Blockbuster? Netflix sure does. Although once a formidable rival, Netflix is now one of the leading companies of the century. Like this, so many of the brands we know and love each have their own story of success. Explained through short and fun comics, Behind the Logo illustrates how companies like Netflix and Nintendo became legends.",
        "slug": "1219",
        "cover": "https://static.manta.net/2021-02-26/5Z/5ZbjI5x0SO2BI2Ot.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T02:46:51.794Z"
    },
    "Suddenly a Lady": {
        "author": "EYERING",
        "artist": "EYERING",
        "description": "Deok, a slave girl, would sooner choose death than let her future kids inherit this life. But then her master presents her with an absurd offer: \"I'll make you a noblewoman.\" Deok is elated at the thought of escaping slavehood. But first, she must become a lady.",
        "slug": "1307",
        "cover": "https://static.manta.net/2021-06-07/79/79QxB5nPPFOIu6xI.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:58.989Z"
    },
    "Let's Get You Better": {
        "author": "null",
        "artist": "Haerong",
        "description": "Plagued by health issues, Boni Min is basically a walking hospital. Then one day a mysterious guy appears. He moves in, gives her medicine, and explains them all to her. Turns out the information is quite useful! Soon enough, Boni finds herself falling for his cold-but-warm-hearted charms...",
        "slug": "1381",
        "cover": "https://static.manta.net/2021-07-09/DV/DVnZMQ4MKf65Ztlu.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T02:48:09.903Z"
    },
    "Temple Romance": {
        "author": "YIWON HEO",
        "artist": "HONGSEUL",
        "description": "Siwon attracts women wherever he goes. Yet, he’s a virgin, thanks to a personal stalker who always gets in the way. When a psychic says he can escape her by becoming a monk, he joins a temple. Meanwhile, Yoonchae hates the idea of love after years of living with horny parents and only joins the temple because she is forced to. What will become of this man desperate to experience love and this woman who wants nothing to do with it?\n",
        "slug": "1169",
        "cover": "https://static.manta.net/2021-02-19/mp/mpgdZ7e5oxinS8jU.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T08:00:51.235Z"
    },
    "Killing Mr. Park": {
        "author": "Wonseob Sin",
        "artist": "Boiler Kim",
        "description": "One day, Sujin confesses to Min that she wants to kill her husband, Mr. Park, during the company field trip. Min, who has had a crush on Sujin for a long time, agrees to help her with her plan. But on the trip, despite seeming as if she doesn't remember the plan, Sujin acts strangely. What agenda could Sujin be hiding? ",
        "slug": "1129",
        "cover": "https://static.manta.net/2020-12-10/VQ/VQe3E2ZzNloR7MUv.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T08:21:32.586Z"
    },
    "Sucker Trick": {
        "author": "LIM",
        "artist": "LIM",
        "description": "They were called monsters and witches before they were accepted into society. Now, they're known as magicians, and they exist to protect and assist humans. There are 24 of them in this world, each with their own rank and abilities. The curtains are drawn, and the stage is ready for them.",
        "slug": "1305",
        "cover": "https://static.manta.net/2021-04-28/mt/mtmHwt5clrBUKGLd.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-02T03:41:46.177Z"
    },
    "The Handbook of Morality": {
        "author": "Succulent",
        "artist": "Succulent",
        "description": "School teacher Yumi is back in her hometown. She's heard that her old elementary school uses \"The Handbook of Morality\" in their curriculum, and she's excited to start teaching there. But after running into an old classmate, Yumi is reminded of a past she's desperately tried to forget...",
        "slug": "1328",
        "cover": "https://static.manta.net/2021-07-05/6a/6aLlcfzD5f0dvMol.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-14T06:25:10.920Z"
    },
    "Miss You, Lucifer": {
        "author": "Moscareto",
        "artist": "Okdong",
        "description": "Lucifer, a member of the obscure idol group Sweet Devils, dreams of making it big. His one claim to fame — an accidental pants-ripping on air — leads to a chance encounter with A-list star Kwonjun Kang. Turns out, Kwonjun has been harboring an intense crush on Lucifer. What will happen when an unexpected one-night stand leads to an ambiguous romance? How will this A-list star and D-list idol navigate their relationship? ",
        "slug": "1272",
        "cover": "https://static.manta.net/2021-01-21/WH/WHA5yLjB1WXSUm1d.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-25T05:24:25.889Z"
    },
    "Back to the Highteen": {
        "author": "Giseon",
        "artist": "Hongseul",
        "description": "At the age of 27, Boyoung’s reached an all time low. She’s just been dumped, scammed, and still hasn’t graduated from college. When she’s offered the chance to go back to high school in return for a large sum of money, she can’t resist. All she has to do is make sure nobody finds out. Shouldn’t be hard… right?",
        "slug": "1144",
        "cover": "https://static.manta.net/2021-06-07/Bs/BsBsuEkIq5DzBAxx.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-18T08:57:37.649Z"
    },
    "Totem's Realm": {
        "author": "SOOHYEON",
        "artist": "SOOHYEON",
        "description": "In a crazy turn of events, Sera, an office worker, is stranded on a remote island and captured by a native tribe. A mysterious Tarzan-esque man rescues her, but it turns out he’s also on the run. As they flee the tribes that are after them, Sera develops a special power she can’t quite understand. She also feels attracted to the strange man... ",
        "slug": "1257",
        "cover": "https://static.manta.net/2022-04-12/iO/iOgRq0YQq1qGN08V.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-05T09:53:48.502Z"
    },
    "Crush on You": {
        "author": "Gill Son",
        "artist": "Gill Son",
        "description": "Ever since her parents died in a car crash, Minhee has lived with Pilho’s family, who openly discriminate against her. After an unexpected meeting with the new neighbor, Minhee finds herself growing closer to him, telling him all of her worries. But turns out… he’s a new teacher at her school. Meanwhile, Pilho’s feelings for Minhee grow. Between the forbidden love and her long-time friend, who will Minhee choose? ",
        "slug": "1173",
        "cover": "https://static.manta.net/2021-04-17/DK/DKHuJNNyp4UZpluy.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T05:31:50.158Z"
    },
    "If You Wish": {
        "author": "Eulwon Ko",
        "artist": "Dodo",
        "description": "Jiyoung, an ordinary high school girl, just happens to come across God? God is fascinated that Jiyoung has never called for Him and suggests a bet: during His stay in the human world, if Jiyoung can suppress the urge to ask Him for anything, He will give her everything she can possibly wish for. She doesn't want to say yes, but who can say no when God looks this good! ",
        "slug": "1167",
        "cover": "https://static.manta.net/2020-11-19/38/38n6Cg1IUtCYSzZ4.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-18T02:18:05.585Z"
    },
    "The Frog Princess": {
        "author": "CC",
        "artist": "CC",
        "description": "When a magical potion that can transform any living organism into a human goes awry, it’s up to Sarang the Chameleon to harvest the power of true love and save the Demon World. But can a chameleon masquerading as a human truly blend in with society and accomplish her goal?",
        "slug": "1467",
        "cover": "https://static.manta.net/2022-05-24/el/elZ4EE9BYm0mb28w.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T07:02:11.387Z"
    },
    "Boy From the Future": {
        "author": "Ine",
        "artist": "Ine",
        "description": "High school students Dain Son and Sihyun Lee could hardly be called close. One day, Dain is approached by a man who claims to be Sihyun from the future. What’s more, he says they end up dating and he has traveled back in time to stop a murder. As Dain and “future Sihyun'' become more involved, Dain and “present Sihyun”’s friendship also changes. What will become of such entangled relationships? How will the future change?",
        "slug": "1202",
        "cover": "https://static.manta.net/2021-02-19/Li/LiXAPcARW2e1gN3c.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T14:34:29.191Z"
    },
    "200% in Love": {
        "author": "ZZING",
        "artist": "ZZING",
        "description": "Sarang may be a loner at work, but in the MMORPG game Black Star, she’s a charismatic hero! So when the toxic Black Peng steals her thunder as the strongest player, she begins to feel conflicted. Now the search is on — is Black Peng the new Art Director, Junghoon? Or her childhood friend, Joonyoung?",
        "slug": "1699",
        "cover": "https://static.manta.net/2021-12-01/d5/d5eDOxrNH8IWu6r6.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T03:04:00.288Z"
    },
    "Into It": {
        "author": "Ongsim",
        "artist": "Ongsim",
        "description": "An A-list actor and a rookie actor meet on the set of a TV show.\n“Did I… do well?”\nA whirlwind romance that blurs the line between acting and reality!",
        "slug": "1433",
        "cover": "https://static.manta.net/2022-01-19/h9/h9WcCDaQL3cSFSb5.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:28:06.612Z"
    },
    "Taming the Emperor's Hound": {
        "author": "Jyun",
        "artist": "SHINJI",
        "description": "About to be trapped in a loveless marriage, Esmeralda is determined to find a husband of her own choosing. When the handsome Lord Alfonse woos her at her first society event, she decides to take a gamble and asks him to court her. But why didn't anyone tell her he's the emperor's hound?!",
        "slug": "1767",
        "cover": "https://static.manta.net/2022-07-08/NW/NWBiZ1k03LCmWFfu.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T01:50:45.399Z"
    },
    "Fry My Life": {
        "author": "Bohyun Kim",
        "artist": "Kkingkkang",
        "description": "After an innocent favor blows up in his face, Hachan is desperate to start afresh. His last remaining hope is to infiltrate a mysterious fried food shop to reveal its secret, which will guarantee him a job as a reporter. But his investigation soon takes him down a completely unexpected path...",
        "slug": "1833",
        "cover": "https://static.manta.net/2022-06-02/NN/NNiJvpbYegeo7JgW.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-10T15:33:55.807Z"
    },
    "My High School Romance": {
        "author": "Seyoung Kim",
        "artist": "Seyoung Kim",
        "description": "Seunghyun hates losing, and so does Yujin. Afraid of losing his brother to Yujin, Seunghyun asks him out. And Yujin, wanting to make Seunghyun suffer, accepts. What could possibly go wrong? More importantly, who's gonna win?!",
        "slug": "1239",
        "cover": "https://static.manta.net/2021-12-01/Re/RePVRkHJNt2P6P69.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T05:59:43.497Z"
    },
    "Go, Haechi, Go!": {
        "author": "Yushin Kim",
        "artist": "Yushin Kim",
        "description": "Legendary creature Haechi lives in Gyeongbokgung Palace. Endearingly round and soft, he has oodles of affection for everyone he meets. What kind of mischief will he get up to today? And what joy will he bring to the ladies of the palace? Follow Haechi's high jinks as he brightens everyone's day!",
        "slug": "1402",
        "cover": "https://static.manta.net/2021-07-09/zA/zA2dnKGIzn0vDcPj.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T02:47:47.169Z"
    },
    "The Great Selection": {
        "author": "Eugene Beom",
        "artist": "Sunmin",
        "description": "Gana's mother disappeared when he was young, but he believes she may have turned into a dolphin since he can communicate with them. Bullied by his family and other villagers, Gana must decide if he thinks all humans should perish, or if there are enough good ones to cancel out the bad.",
        "slug": "1132",
        "cover": "https://static.manta.net/2020-11-19/gi/gi1CFFsvAOw16eau.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-07T07:18:34.882Z"
    },
    "Cheolsu Saves the World": {
        "author": "SooSun",
        "artist": "SooSun",
        "description": "Humanity has failed to stop a giant asteroid from plummeting into Earth, and life as we know it has ended. An ordinary Korean office worker named Cheolsu is somehow given the chance to go back in time and prevent this catastrophe from ever happening. Does he have a chance?",
        "slug": "1826",
        "cover": "https://static.manta.net/2022-04-01/lX/lXEqC6fnfIxg8Qs6.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-14T06:04:53.703Z"
    },
    "The Emperor's Mask": {
        "author": "Yeoldu",
        "artist": "Yeoldu",
        "description": "Imagine blacking out and waking up in a different world! A teacher finds herself in the body of Lady Lucia, a woman who committed suicide. While trying to understand what happened, she realizes Lucia was actually murdered. Why does the emperor hide behind a mask? And what really happened to Lucia…?",
        "slug": "1401",
        "cover": "https://static.manta.net/2021-06-23/Yp/Yp0KJTj8tpBz8auL.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:52:45.602Z"
    },
    "Her Peculiar Visitor": {
        "author": "doomin",
        "artist": "doomin",
        "description": "Banished from the celestial realm for interfering in the fate of a mortal, Juhee now lives a mortal life herself as the owner of a bookstore. When she suddenly receives an eviction notice, she visits her landlord to plead her case. But what will she do when he makes her a peculiar offer?",
        "slug": "1429",
        "cover": "https://static.manta.net/2022-02-01/32/324l4F90eGxJi3z2.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T08:52:21.097Z"
    },
    "Serial Justice": {
        "author": "GOEULWON",
        "artist": "GOEULWON",
        "description": "Aria has been a victim of domestic violence since childhood. Eventually, she sees only one way out: murder. After she kills her father, she sets out to save other victims, and crosses paths with a detective who decides to help her. But can she really justify murder in the name of justice?",
        "slug": "1282",
        "cover": "https://static.manta.net/2021-01-31/rI/rIduE1K8gp3OmpOa.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T05:47:46.628Z"
    },
    "The Perfect Replacement": {
        "author": "Il won",
        "artist": "Il won",
        "description": "My sister is perfect — so much so that she's been chosen as the hero of another world called Rowold. While she's off saving this new world, she's been replaced by Moomyung, an aloof Rowoldian. He's not the most convincing substitute, so I'm helping him out. But I'm learning from him too.",
        "slug": "1278",
        "cover": "https://static.manta.net/2021-05-04/hp/hp0JZC7TphXASbKd.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-13T02:04:28.669Z"
    },
    "The Golden Forest": {
        "author": "Gyeonji",
        "artist": "Ryuhwa",
        "description": "\"Don't forget. You owe me a life, and you promised to be mine.\" Reniae was blessed with the ability to charm men by the goddess Inanna. But for her, it feels more like a curse. After being taken as a slave to the Golden Forest, she flees to the Northland where she finds Kun... and saves his life.",
        "slug": "1322",
        "cover": "https://static.manta.net/2022-04-01/14/145HrSde9xsjcxKE.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-20T11:23:43.949Z"
    },
    "The Summer of Penguins": {
        "author": "Ahyoung Woo",
        "artist": "Heejun Yoo, Dabhin Yu ",
        "description": "Animal behaviorist Hyunwoo's love for penguins drives him all the way over to Antarctica. Once there, however, he encounters a series of mishaps and soon discovers that surviving in the harsh cold is no easy feat. Will Hyunwoo be able to conduct his research and return to Korea in one piece?",
        "slug": "1749",
        "cover": "https://static.manta.net/2021-12-17/7s/7sfHxB8mSBcFiXDt.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-07T08:25:42.622Z"
    },
    "The Competition": {
        "author": "Jeong, Seol-hwa",
        "artist": "Jeong, Seol-hwa",
        "description": "Isn't classical music for the rich? Hokyung grew up in an average house, so despite his passion for the violin, he never dreamed of becoming a violinst. When the small violin he had outgrown breaks, his visit to the luthier takes him on an unexpected journey...",
        "slug": "1387",
        "cover": "https://static.manta.net/2022-03-11/tk/tk66XzwNmQKbv4qs.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-28T05:56:08.874Z"
    },
    "The Dangerous Convenience Store": {
        "author": "945",
        "artist": "945",
        "description": "Lovesick college student Uijun works part-time at a convenience store in a sketchy, dangerous neighborhood, when one day the sexy, dangerous Geonu makes his grand entrance! But after drunkenly pouring his heart out to him, will Uijun get more than he bargained for?",
        "slug": "1241",
        "cover": "https://static.manta.net/2022-01-27/vl/vlz4cR6EaFsEdEqs.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-10T15:34:35.489Z"
    },
    "Snapshots of Beckhee Gong": {
        "author": "MINJI JEON",
        "artist": "MINJI JEON",
        "description": "For Beckhee, who lives in a broken household with a cheating father and a depressed mother, fangirling over the popular K-pop star Tinkerbell was her only solace. But when she realizes that the image of Tinkerbell she had loved for so long was only a fantasy, Beckhee decides it’s time to live for herself, and suddenly moves to Japan. What adventures will she embark upon in her new life? ",
        "slug": "1128",
        "cover": "https://static.manta.net/2020-11-19/qS/qSMnoAiXTzqhkmEF.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-14T03:30:33.994Z"
    },
    "Observing Elena Evoy": {
        "author": "Myeongcho",
        "artist": "Dorong",
        "description": "Blessed with both beauty and brains, it was only natural for Johann to be the top student at the Academy — that is, until Elena Evoy appears. To make things worse, she seems completely unfazed by his charms, shattering his self-esteem. So why can't he stop thinking about her?",
        "slug": "1317",
        "cover": "https://static.manta.net/2021-12-03/OA/OAobelYw3zM0cMQa.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-13T03:32:19.240Z"
    },
    "Resurrection": {
        "author": "Gunwoo Jeon",
        "artist": "Kwonsam",
        "description": "Taesoo, K, and I have been best friends since elementary school but one day, K stops coming to school. Taesoo and I visit K but see him die of illness before their very eyes. K's mom tells them that to resurrect K, she has to get the right \"ingredients\"...",
        "slug": "1134",
        "cover": "https://static.manta.net/2020-11-19/mC/mCDz129PQUOpY3Z5.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-14T08:26:32.579Z"
    },
    "Pandora's Choice": {
        "author": "Yudori",
        "artist": "Yudori",
        "description": "19th century America can be unforgiving to a half-Asian daughter and alcoholic single father. Pandora, a feisty child, suffers from racial discrimination and the indifference her own father, Christopher, shows towards her. As a result, the two never seem to get along and any interaction leads to a fight. A World Comic Contest Winner, this is a story of two broken people trying to make sense of this world together. ",
        "slug": "1205",
        "cover": "https://static.manta.net/2020-12-09/u5/u58pEXROArDxCQsH.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:51.600Z"
    },
    "The Unseen": {
        "author": "Gyosun",
        "artist": "Gyosun",
        "description": "After a strange incident, Yohan turns invisible with only one friend knowing of his condition. After spending weeks frustrated and alone, he bumps into Eunha, a blind girl, who doesn't realize that he is invisible. What happens when a boy who can't be seen meets a girl who can't see?  ",
        "slug": "1120",
        "cover": "https://static.manta.net/2020-11-19/wx/wxrcYX3qyM3M52Vh.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-31T16:01:55.636Z"
    },
    "The Kiss Virus": {
        "author": "Hyejung Kim",
        "artist": "MIK",
        "description": "“Have you kissed someone yet?” Yoona is constantly pestered by her parents to hurry up and kiss a boy. Why? Because students who don’t kiss someone before they turn 17 go crazy every time it rains! Yoona doesn’t want to wind up like the others at her school. Will she find someone to kiss in time?",
        "slug": "1235",
        "cover": "https://static.manta.net/2021-01-21/zR/zRfeVCmUNT3pPmLp.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T14:30:10.281Z"
    },
    "Winter Night": {
        "author": "Yeonji",
        "artist": "Yeonji",
        "description": "After running into the mysterious Myodan one morning, Aram begins to see animal spirits. His newfound ability gets him sucked into the world of Winter Night, where he discovers that an unknown force is terrorizing innocent spirits. Will he and Myodan be able to solve this case?",
        "slug": "1308",
        "cover": "https://static.manta.net/2021-06-29/Cq/CqpakbBkynptl1VZ.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-10T09:23:02.083Z"
    },
    "If I Were You": {
        "author": "Winter",
        "artist": "Ji yoon",
        "description": "Set in the Japanese colonial period, a young girl is gifted a maidservant who looks just like her on her 8th birthday. The fate of the two children entwines as they each carve out their own destiny, surpassing obstacles such as status and gender, education and culture, and ethnicity and race.",
        "slug": "1261",
        "cover": "https://static.manta.net/2021-11-30/x5/x5XAl9NtQ7n6Z4t5.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-01T02:37:38.310Z"
    },
    "Like You've Never Been Hurt": {
        "author": "KYY",
        "artist": "KYY",
        "description": "College student Izzy Noh thinks her loving relationship with her boyfriend Minsu will last forever… until he cheats on her. To make things worse, they are not only in the same school, but in the same Game Developer Club. Izzy must now navigate handling the breakup, dealing with her feelings, and possibly opening up to another shot at love. Will Izzy and her friends from the Game Developer Club find true campus love? ",
        "slug": "1172",
        "cover": "https://static.manta.net/2020-11-19/6F/6F7irvn5zOd4IB3q.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-03-15T16:22:21.086Z"
    },
    "The Greatest Villain": {
        "author": "Sujin Kim",
        "artist": "Sujin Kim",
        "description": "Best friends Sawoo and Kido are polar opposites. When Sawoo realizes his innocent attitude was causing him to be bullied, he asks Kido to coach him in becoming the greatest villain. Kido succeeds in teaching him two out of the three rules before moving abroad. When Kido returns after four years, will Sawoo learn the third rule? And why does Kido seem to be so affectionate towards him? They’re just friends… right? ",
        "slug": "1147",
        "cover": "https://static.manta.net/2020-11-27/SS/SSER4HjeE4bZaNtC.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:47.591Z"
    },
    "Love on Hold": {
        "author": "YU HYUN SUK",
        "artist": "YU HYUN SUK",
        "description": "When Danhee's boyfriend Jeonghu tells her he wants to spend some time apart, she decides to use this chance to enjoy her freedom. But after running into her former crush, Taeyong, she begins to wonder what she really wants out of life.",
        "slug": "1441",
        "cover": "https://static.manta.net/2022-02-18/u2/u2PikgEBrdPUWmfh.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-13T12:06:49.259Z"
    },
    "Whispers Through the Willows": {
        "author": "Moscareto",
        "artist": "sue",
        "description": "Sangyul's been living a lie since birth. Everyone thinks he's the feeble, omega son of Jodong Pharma's President Han, but in reality, he's as normal as can be. So what's he to do when Korea's sole alpha, Prince Reok, proposes an interesting deal? Will he finally get the ordinary life he so desires?",
        "slug": "1423",
        "cover": "https://static.manta.net/2022-05-09/5B/5Bro1IZByqveP9nm.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T05:55:36.503Z"
    },
    "Byte-Sized Insight": {
        "author": "Bumgeun Song",
        "artist": "Daewoong Lee",
        "description": "Hi! We're Outstanding, a tech media outlet. The tech and business world is full of innovation and fierce competition. Which company received $2 billion in investments before they even launched? Who saved Apple after Jobs? We bring you all the latest stories in the form of fun and simple comics!",
        "slug": "1218",
        "cover": "https://static.manta.net/2021-03-07/FG/FGrC40gIqiHS4yms.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-15T02:46:39.364Z"
    },
    "The Good Life": {
        "author": "Eo Jin",
        "artist": "Jiae",
        "description": "Yoochang is a good-looking guy. So good-looking, in fact, that he had to transfer to an all-boys school to escape the horde of adoring girls. But now he's gone from being the subject of catfights to having guys brawl over him! Just how far will Yoochang's good looks take him?\n\n",
        "slug": "1336",
        "cover": "https://static.manta.net/2021-05-25/1V/1VRKZhK6rwuem5it.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T06:56:18.691Z"
    },
    "On the Emperor's Lap": {
        "author": "Yujeong Ju",
        "artist": "Miran Lee",
        "description": "At a young age, little orphan Bella was abandoned by Kiris. His betrayal left her a war slave. Years later, Bella finds herself reunited with Kiris — only now, he doesn’t recognize her. Will Bella be able to overcome the pains of her past to find love again?",
        "slug": "1213",
        "cover": "https://static.manta.net/2021-12-23/vg/vgCsLrsvPWSWTOxv.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:51.976Z"
    },
    "Tori and Samuel": {
        "author": "Bobblejot",
        "artist": "Bobblejot",
        "description": "Best friends for life: The story of a sardonic cat and an eager corgi. Follow their adventures as they learn how to live together, care for each other, and welcome new members into their lives!",
        "slug": "1698",
        "cover": "https://static.manta.net/2021-09-03/n1/n1bRE5Ijpq0krY8Z.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-08T00:45:46.878Z"
    },
    "The Butterfly Girl": {
        "author": "Hyeon",
        "artist": "Hyeon",
        "description": "17-year-old Bibi Na has a special power -- she can form a chrysalis, and just as a caterpillar transforms into a butterfly, she can emerge with a new look, personality, and abilities. To escape her trauma of being bullied in middle school, she decides to transform. Things get complicated when she transfers schools and meets Yeonwoo, a boy who seems to know about her past. Will Bibi’s power be a gift, or a curse?",
        "slug": "1203",
        "cover": "https://static.manta.net/2021-02-19/Lw/Lw9Tc1XD2ehO6b24.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-29T17:25:46.145Z"
    },
    "By My Side": {
        "author": "Junghyun",
        "artist": "Junghyun",
        "description": "Hyungbae is a bit of a workaholic. Underappreciated and overworked, he feels burnt out at his current job. Enter Deokbae, a carefree dog that has a mind of his own! Follow Hyungbae and his canine companion as they navigate the ups and downs of life, bringing a whole new meaning to the word \"family.\"",
        "slug": "1462",
        "cover": "https://static.manta.net/2022-03-11/iN/iN2rZU2xikYhzKlv.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-21T05:22:38.562Z"
    },
    "Ouroboros: The Social Cycle": {
        "author": "LEE JUNG YOON ",
        "artist": "LEE JUNG YOON ",
        "description": "Life at school is bleak for outcast Hyun. But one day, she receives a letter from Jung, her dear old friend from middle school. Filled with nostalgia and excitement, Hyun begins reading the letter... only to discover that their time together was a nightmare for Jung. Where did it all go wrong?",
        "slug": "1437",
        "cover": "https://static.manta.net/2022-02-18/H1/H1oTlDNyamLKZT9T.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-27T03:55:50.362Z"
    },
    "[ blank。]": {
        "author": "lins",
        "artist": "lins",
        "description": "After waking from a 3-month coma, Nina doesn’t remember anything about herself. Not even her name. With no one looking for her, she only has one option: to start a new life. She’s more than ready to do so until the memory of someone abandoning her in a park haunts her. Can she handle the truth?",
        "slug": "1858",
        "cover": "https://static.manta.net/2022-06-02/Nc/NcYxNhkGD3r4QaFp.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-10T08:39:20.546Z"
    },
    "Kneel Before Me": {
        "author": "Sosoo",
        "artist": "Sosoo",
        "description": "When the unfaithful crown prince calls off their marriage, Lady Kyrie is exiled to a remote cottage. On the way, she discovers a hidden village while avoiding a snowstorm. It's there \"the end\" is awakened... and it's starting to become obsessed with her.",
        "slug": "1783",
        "cover": "https://static.manta.net/2022-04-20/BT/BTgneX9dFVLkUJ8M.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-09T03:33:58.976Z"
    },
    "DEAR. DOOR": {
        "author": "Pluto",
        "artist": "Pluto",
        "description": "After an investigation into a mysterious cult turns supernatural, police officer Kyungjoon wakes up and finds himself trapped in a place engulfed in flames, crying out in pain. But a mysterious entity tells him he can't die without their permission. What has Kyungjoon gotten himself into?!",
        "slug": "1224",
        "cover": "https://static.manta.net/2021-07-22/Hw/HwUFWP3xrtpimf5C.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T08:18:50.341Z"
    },
    "Boy's Lipstick": {
        "author": "MIYEON CHOI",
        "artist": "MIYEON CHOI",
        "description": "B-Magic is the hottest beauty vlogger in the beauty industry. Everyone is always waiting for her next upload! Little do they know that B-Magic is trying to live a normal life as a high school boy? What secrets is she hiding? And will her classmates uncover her identity? ",
        "slug": "1124",
        "cover": "https://static.manta.net/2020-11-19/Cs/CsouicR8bpZEu4Xs.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:55.726Z"
    },
    "Für Elise": {
        "author": "Korichire",
        "artist": "Korichire",
        "description": "Taewoo and Yunsol have always been an unlikely pair. As childhood best friends, both are too afraid of losing the other to admit their feelings. But when Yunsol’s soul becomes a part of her doll after a messy accident, things get even more complicated. Will the two be able to find a way for Yunsol to become human again.. and find love on the way?",
        "slug": "1126",
        "cover": "https://static.manta.net/2020-11-19/o2/o2PKNWeglmeS8s7X.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-02-20T11:18:03.105Z"
    },
    "House of Suspects": {
        "author": "Hwiyoung",
        "artist": "Hwiyoung",
        "description": "Jack, an animal taxidermist, is branded as a murderer. He was the only one found at the horrendous site, surrounded by blood and a mutilated corpse. The catch: he can’t remember any of it. To escape the stinging glares, he decides to stay at a house for outcasts in the middle of the woods. But could his housemates be hiding secrets of their own? ",
        "slug": "1123",
        "cover": "https://static.manta.net/2020-11-19/wE/wERulm1Vp5HRHtp5.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:56.120Z"
    },
    "Wild Dog Misfire": {
        "author": "Yonghyun",
        "artist": "Junghyun Kim",
        "description": "After his divorce and demotion, Detective Yoon thinks life can't possibly get worse. That is, until his sister asks him to move in with her fiancé Junggu, a former bombmaker trying to get a fresh start. But just as the two misfits become flatmates, Junggu's past comes to haunt him with a bang.",
        "slug": "1268",
        "cover": "https://static.manta.net/2022-02-18/0K/0KBubPoW6KF3Xonu.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-27T03:35:46.206Z"
    },
    "Justice for the Villainess": {
        "author": "STUDIO107",
        "artist": "STUDIO107",
        "description": "Charlotte has no qualms about murder if it means her beloved Prince Albert can ascend to the throne. But when he accuses her of treason and leaves her to rot in prison, she learns that loyalty is no virtue. 5 years later, Count Kaitel appears before her with a request: “Won’t you kill the emperor?”",
        "slug": "1384",
        "cover": "https://static.manta.net/2021-11-08/X6/X6OSmtxnrfM3ZkO7.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T01:14:41.569Z"
    },
    "The Quant of Wall Street": {
        "author": "Hyojin Kim",
        "artist": "Jooyoung Jeong",
        "description": "The number of individuals investing in stocks is growing daily. But for every brilliant success story, there are countless failures. It isn't easy for small investors to succeed in the ruthless world of stock trading. Still, it isn't impossible — if you can just think like a quant!",
        "slug": "1792",
        "cover": "https://static.manta.net/2022-05-24/6f/6fjYJTtNfmnz8wgV.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-24T10:09:52.254Z"
    },
    "G'day": {
        "author": "Choi Yong Sung",
        "artist": "Choi Yong Sung",
        "description": "After suddenly losing contact with his sister, Shion heads to Australia on a working holiday visa to find her. As he meets her housemates, he grows particularly suspicious of Hans, the owner of the sharehouse. He just can't shake the feeling that he's done something to her...",
        "slug": "1258",
        "cover": "https://static.manta.net/2021-06-23/BN/BN0CaKg50KO45Fgw.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:53.060Z"
    },
    "Core Scramble": {
        "author": "Euho Jun",
        "artist": "Euho Jun",
        "description": "Monsters called “Bugs” plague the world. Chaeun, a member of the bug-exterminating organization \"C.O.,” finds his chief, Gayoon, both infuriating and admirable. Meanwhile, Chaeun catches the attention of Moonhoo, a member of the rival organization. What will become of this love triangle in this dangerous world? ",
        "slug": "1209",
        "cover": "https://static.manta.net/2020-11-23/PE/PESLsc1VEuzKQ3sA.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:28:24.109Z"
    },
    "BASKI": {
        "author": "CHUL-SOO JIN",
        "artist": "KI-HYUN BYUN",
        "description": "A bank heist… committed by people with superpowers. When this news reaches police officer Young-In Jin, he suspects it could be linked to a meteorite crash he saw with his friends years ago. What are his childhood friends hiding? And why does he suddenly wake up in a strange room? As he digs deeper into the case, some shocking truths are revealed...",
        "slug": "1145",
        "cover": "https://static.manta.net/2021-04-12/J2/J2Qos8A9uPRJ4pV2.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-11-19T06:48:15.087Z"
    },
    "Lifeless Man": {
        "author": "Kim Nyeong",
        "artist": "Kim Nyeong",
        "description": "Jun Ha can see the lifespan of everyone. Years ago, he was traumatized when he realized one of his high school friends had the shortest lifespan and yet he was unable to do anything. Years later, he's now a well known genius surgeon who ends up getting involved with a gangster who has no lifespan number...",
        "slug": "1146",
        "cover": "https://static.manta.net/2020-11-19/m1/m17Kbo2Qhct8CqW5.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-05-31T08:37:38.216Z"
    },
    "Something About 30": {
        "author": "Hyewon",
        "artist": "Hyewon",
        "description": "At the age of 31, up-and-coming cartoonist Jiwon can't seem to get a date. Then she runs into her childhood crush at work — only he doesn't seem to recognize her! Will she be able to find love while juggling work, life, and her friendships? Born in '85, this is her story.",
        "slug": "1304",
        "cover": "https://static.manta.net/2021-06-07/TO/TOTqrUd1uS6LPTbI.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:57.543Z"
    },
    "A Compendium of Ghosts": {
        "author": "Lee Yul",
        "artist": "Lee Yul",
        "description": "Sejin, a shaman’s daughter, and Sang, who was teased for being easily scared, are childhood friends. Years later, Sang returns as a huntsman, but Sejin notices that a mysterious black ghost is trailing him. Will Sejin, who seems to be the only one to see the ghost, be able to save Sang and the huntsmen from the spirits that plague their village? ",
        "slug": "1176",
        "cover": "https://static.manta.net/2020-12-09/De/De08q7Zk1j0nUnEl.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:48.548Z"
    },
    "Something About Us": {
        "author": "Lee Yunji",
        "artist": "Lee Yunji",
        "description": "Gayoung and Woojin are practically an inseparable pair. In high school, they were always asked if they were dating or if one of them secretly had feelings for the other. For the most part, it has always been pretty platonic for the two. But now, things are starting to feel different. ",
        "slug": "1184",
        "cover": "https://static.manta.net/2020-12-09/2i/2igGVjZRJ0izaPdA.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:49.406Z"
    },
    "Interview with a Murderer": {
        "author": "KJK",
        "artist": "KJK",
        "description": "Clark needs a story. Luckily, an old flame reaches out claiming to be the psychiatrist of a man named Alex, otherwise known as the Triage Killer. Perhaps it’s doctor-patient confidentiality, but the doctor has yet to report Alex to the police. Instead, he’d like Clark to interview him as a part of his patient’s therapy. Alex only requires one thing in exchange: Clark.",
        "slug": "1731",
        "cover": "https://static.manta.net/2022-04-09/Dv/DvxLOTWIXzkXKtF8.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T06:43:10.334Z"
    },
    "Talk to Me Tenderly": {
        "author": "SingSing",
        "artist": "SingSing",
        "description": "Gabriel, a virgin, was just calling to complain about a defective adult toy... but he instantly falls for the voice of the call center operator. Soon after, a man with the same deep, husky voice appears. What happens when two more beautiful men enter the picture? Surrounded by three gorgeous men, Gabriel's love life is about to be shaken up!",
        "slug": "1210",
        "cover": "https://static.manta.net/2020-12-15/Vt/VtvDj1XPevcEsuPU.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T08:05:54.913Z"
    },
    "Dubious Moon": {
        "author": "Yujeong Ju",
        "artist": "ezyoung",
        "description": "Office worker Shiwon is fed up with her antisocial manager, Mr. Moon, who barely acknowledges her work. To everyone’s horror, Shiwon drunkenly calls out Mr. Moon in front of all of their co-workers. The next day, Shiwon means to apologize to Mr. Moon but… accidentally confesses her feelings? What’s more, Mr. Moon accepts? As their relationship deepens, will they be able to keep their office romance a secret? ",
        "slug": "1211",
        "cover": "https://static.manta.net/2021-03-15/5z/5zPIbMV5ObUekPGH.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-17T08:12:30.187Z"
    },
    "The Knight's Unfulfilled Dreams": {
        "author": "SUJIN KIM",
        "artist": "SUJIN KIM",
        "description": "Ian and Prince Kaliyan were passionate lovers. But when Kaliyan finally rises to the throne, he condemns Ian’s brother, Robin, to a life in prison. Betrayed and enraged, Ian returns years later to assassinate Kaliyan. What will happen when Kaliyan threatens to kill Robin unless Ian becomes his lover? A convoluted story of hate, revenge, and lust. ",
        "slug": "1151",
        "cover": "https://static.manta.net/2020-11-24/x6/x6X2bFGCa16QLqdC.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:47.711Z"
    },
    "Moonrise by the Cliff": {
        "author": "JYL",
        "artist": "JYL",
        "description": "A lone house perched on the cliff of a miserable little island, and the man who was dethroned and exiled there. I watched him on behalf of my sickly father... and I dared to fall in love with him. Without even knowing what my fate entailed. ",
        "slug": "1421",
        "cover": "https://static.manta.net/2021-07-30/5D/5DP3tWhSjNBOFEwH.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-07-07T08:41:04.617Z"
    },
    "The Scent of Love": {
        "author": "Youngcho",
        "artist": "Myomyori",
        "description": "Meet Arisol, the first female perfumer and aromatherapist of the Joseon Dynasty. Under the reign of King Seongjong, she cultivates her own plants and manages the perfumery of the royal court. Will she find love and success as she navigates her role as the scent master?",
        "slug": "1377",
        "cover": "https://static.manta.net/2021-11-25/qH/qHm2m3rvTjaTZk5N.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2021-12-30T06:21:54.600Z"
    },
    "Corridor of Mirs": {
        "author": "NOK",
        "artist": "NOK",
        "description": "High school student Nabi is saved in a near-death experience by a mysterious, beautiful man. Turns out, only she saw him. Ever since that day, Nabi begins seeing dark, ominous beings called ‘Reapers,’ parasite-like creatures that feed on negative energy. With the help of the mysterious man, Nabi is introduced to a world she never knew existed. Will Nabi be able to hone her abilities and survive in this world?",
        "slug": "1174",
        "cover": "https://static.manta.net/2021-11-30/71/71JZJyIfeyaa8aG5.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:48.527Z"
    },
    "Ripple Rooter": {
        "author": "ILZI",
        "artist": "ILZI",
        "description": "Vincent pretends to be a librarian in a small village, but really, he’s a supernatural messenger who delivers gifts of fate to humans. Arugio, a new cop, has a mysterious agenda, bringing up forgotten crime files. What will happen when kidnapping cases spike and the evidence points to Vincent? A mystery thriller fantasy to keep you on your toes.",
        "slug": "1142",
        "cover": "https://static.manta.net/2020-12-17/c1/c1wn117BYN8QOzKI.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-04-17T06:01:47.600Z"
    },
    "Thirsty Thirty": {
        "author": "JUNG EunSoo",
        "artist": "JUNG EunSoo",
        "description": "Yaeun is on the cusp of turning thirty — no longer a child, but not yet quite an adult. She spends her days working full-time as the director of a lighting company and sees her boyfriend on the weekends. So why does she feel like something's missing? Is there more to life than just work and love?",
        "slug": "1732",
        "cover": "https://static.manta.net/2022-01-23/Hi/Hi28xvk0VUNzIq78.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-06-24T06:57:17.947Z"
    },
    "Wistful Summer": {
        "author": "Munzi",
        "artist": "Munzi",
        "description": "From the day they met that fateful summer’s day, Henry has secretly been in love with his best friend Sam. But time went on, Sam got married, and Henry kept his first love boxed away in his heart. Twenty years later, their paths cross again, and Henry finds his emotions reigniting once more.",
        "slug": "1726",
        "cover": "https://static.manta.net/2021-12-09/Kn/Kn2vMMlP42FVva9d.jpg",
        "groups": {
            "1": "Manta Comics"
        },
        "last_updated": "2022-01-23T15:23:13.013Z"
    }
}
