{"Amina of the Lamp": {"author": "Eeyeol Chun", "artist": "heeya", "description": "Amina, one of the last wizards, loses her loved ones when her palace comes under attack. Trying to turn back time to save them, she gets stuck inside a lamp. 300 years later, Jakard, a military commander, wakes her up. He has three wishes before Amina returns to the lamp. What will he wish for?", "slug": "1170", "cover": "https://static.manta.net/2021-09-03/X9/X9UnfWoE0HK1zFb7.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-07-04T08:26:08.987Z"}, "The Goblin and I": {"author": "Rabong", "artist": "Rabong", "description": "After surviving an accident, Jiyoo is left with the ability to read memories, thoughts, and emotions left behind in various objects. She's been using her ability for the greater good, but after becoming the subject of unwanted attention, she's decided to stop... until Young turns up at her school.", "slug": "1274", "cover": "https://static.manta.net/2022-05-05/a9/a9MOmtnCH040V6Lp.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-05-13T03:50:37.045Z"}, "Immortal Days": {"author": "Heo Gin Gae", "artist": "Heo Gin Gae", "description": "Ever since scientists uncovered the secret to immortality, everyone can live forever. But of course, there are bound to be mutants. Myeol, a mortal, was just trying to get a safe, normal job when he is recruited by Phil, a reckless, good-natured troubleshooter. What will happen when the two mortals join forces to fight off a terror organization? ", "slug": "1190", "cover": "https://static.manta.net/2020-12-09/ck/ckih4s3BijfCuBq8.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-07-07T07:33:41.962Z"}, "Phantom High": {"author": "Gaeun Choi", "artist": "Gaeun Choi", "description": "Ingan Kim, a normal human man, suffers an unfortunate fate of having to work as a teacher in Hell's Phantom High, where spirits and monsters are students. His only chance at survival is an elixir he uses to hide his human scent. If his students ever find out that he is human, he will be done for. Everyday, he asks himself: will I be able to keep my human scent hidden from these students who will eat me up? ", "slug": "1137", "cover": "https://static.manta.net/2020-12-03/qx/qxTPdALi7MS5J9SF.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-06-27T05:11:51.451Z"}, "Lifeless Man": {"author": "Kim Nyeong", "artist": "Kim Nyeong", "description": "Jun Ha can see the lifespan of everyone. Years ago, he was traumatized when he realized one of his high school friends had the shortest lifespan and yet he was unable to do anything. Years later, he's now a well known genius surgeon who ends up getting involved with a gangster who has no lifespan number...", "slug": "1146", "cover": "https://static.manta.net/2020-11-19/m1/m17Kbo2Qhct8CqW5.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-05-31T08:37:38.216Z"}, "Traces of the Sun": {"author": "Hawaii", "artist": "Merin", "description": "Strange dungeons have started appearing all over the world and wreaking havoc. Yiseon, a guy with the power to rebuild cities, witnesses his friends being turned into the undead. Hyeon, a powerful hunter, comes to him with an interesting proposition. Yiseon has no choice but to accept his offer.", "slug": "1788", "cover": "https://static.manta.net/2022-05-12/kD/kDLr28jAXrTahXpZ.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-06-28T07:09:36.942Z"}, "Bloody Sweet": {"author": "Lee Narae", "artist": "Lee Narae", "description": "A girl bullied by her classmates accidentally discovers a magical cabinet inside an abandoned church. She is surprised to find a man fall out from the cabinet and lick the blood off her bleeding knees. As she runs away, a mysterious string trails behind her with no end in sight. Where does it lead?", "slug": "1197", "cover": "https://static.manta.net/2021-02-19/06/06hFcORz0h4VwMYB.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-04-17T06:01:50.353Z"}, "Faust": {"author": "LIM", "artist": "LIM", "description": "Back when God, sages, humans, and the Dragon coexisted, there was balance and harmony. But then the Dragon betrayed them and suddenly disappeared, and the world came to an end. This is the story of those left behind in the apocalypse, trapped by the bonds of time.", "slug": "1306", "cover": "https://static.manta.net/2022-02-18/kT/kTG4PX8YA4e2mDfl.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-06-28T07:24:41.131Z"}, "Sora's Eyes": {"author": "Summer", "artist": "Summer", "description": "Sora has descended from the mountains to guard the sickly Jungha. The two have a set of rules to guide them: One, Sora decides what is considered an emergency. Two, Jungha must listen to Sora in an emergency. Three, Jungha must not bully Sora. Will they be able to stick to them?", "slug": "1221", "cover": "https://static.manta.net/2021-03-15/oG/oGCaSfWiZOS2SbUl.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-06-28T04:59:38.607Z"}, "If You Wish": {"author": "Eulwon Ko", "artist": "Dodo", "description": "Jiyoung, an ordinary high school girl, just happens to come across God? God is fascinated that Jiyoung has never called for Him and suggests a bet: during His stay in the human world, if Jiyoung can suppress the urge to ask Him for anything, He will give her everything she can possibly wish for. She doesn't want to say yes, but who can say no when God looks this good! ", "slug": "1167", "cover": "https://static.manta.net/2020-11-19/38/38n6Cg1IUtCYSzZ4.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-02-18T02:18:05.585Z"}, "Here Comes The Queen": {"author": "Gu Xuan", "artist": "Yang Xiao Bai De He Hezi", "description": "A weak, C-list actress falls into the sea and returns with a 180-degree temperament change as a frightening and ruthless killer. Bigwigs from all walks of life humbly submit to her. Now referred to as the \"Reaper\", the queen both entertains and punishes evil. Shh, here comes the queen!", "slug": "1843", "cover": "https://static.manta.net/2022-05-25/Lk/LkEitpcW8MQKsJ5r.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-07-07T02:09:29.821Z"}, "Biting the Tiger": {"author": "Mindal Park", "artist": "Mindal Park", "description": "Yunho, vocalist of a popular band, has had a secret crush on his friend Kyunghoon for years. That is, until Kyunghoon announces that he has fallen in love with another man. In despair, Yunho runs away and bumps into Hanwool, a mythical tiger grim reaper.", "slug": "1194", "cover": "https://static.manta.net/2020-11-24/q5/q584wfsDFZtYbqx1.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-04-17T06:01:49.540Z"}, "Unbreakable Master": {"author": "Jeon, Yu-ho", "artist": "Jeon, Yu-ho", "description": "Naru has always believed he was cursed — whatever he touches breaks. But when a glass-shattering incident leads to a twisted encounter with a man who has supernatural powers, Naru begins to realize there's a world beyond his own where unimaginable powers exist...", "slug": "1390", "cover": "https://static.manta.net/2021-08-13/Sn/SnVFNoaO84sUBvVM.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-07-05T06:52:18.178Z"}, "Corridor of Mirs": {"author": "NOK", "artist": "NOK", "description": "High school student Nabi is saved in a near-death experience by a mysterious, beautiful man. Turns out, only she saw him. Ever since that day, Nabi begins seeing dark, ominous beings called ‘Reapers,’ parasite-like creatures that feed on negative energy. With the help of the mysterious man, Nabi is introduced to a world she never knew existed. Will Nabi be able to hone her abilities and survive in this world?", "slug": "1174", "cover": "https://static.manta.net/2021-11-30/71/71JZJyIfeyaa8aG5.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-04-17T06:01:48.527Z"}, "Cheoyong: A Ghostly Romance": {"author": "Yoonmi Lee", "artist": "Moyun", "description": "Jaehee, who has been able to see ghosts his entire life, will do anything for money. So he doesn't miss an opportunity when he hears of Cheoyong, the ghost able to grant any and all sorts of fortunes. Instead, what he finds is a sleepwalking girl possessed by Cheoyong... What is this all about?", "slug": "1164", "cover": "https://static.manta.net/2021-04-21/v4/v4OgUgo7ZplLdWFb.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2021-11-19T05:30:36.799Z"}, "The Live": {"author": "Ant Studio", "artist": "Seongmoo Hur", "description": "Yoonjae leads an empty life after his wife and daughter are brutally murdered. One day, his journal reveals one mysterious sentence: “You can see them again.” Yoonjae is pulled into a parallel universe where everyone is a player in a lethal game, and the final survivor will be granted any wish. Desperate to be reunited with his family, will Yoonjae succeed in fighting his way in this hellish world to be the last one standing?", "slug": "1250", "cover": "https://static.manta.net/2022-05-06/ij/ij3nzFObXbtnE0qW.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-06-24T01:06:55.458Z"}, "Matchmaker": {"author": "Gguljamong", "artist": "Gguljamong", "description": "Hojoon has always had a recurring dream that features the same girl. When a new coworker claims to be that girl and his soulmate, his world is turned upside down. As he starts regaining memories of what might have been his past life, something doesn’t feel right. Will he be able to piece together the truth? Are all soulmates really meant to be?", "slug": "1161", "cover": "https://static.manta.net/2020-11-19/fW/fWKW7U82ljjpO7aF.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2021-11-19T05:30:19.879Z"}, "Terrarium Adventure": {"author": "DB", "artist": "DB", "description": "Obsessed with the clicker game Infinite Diamonds for over a year, Jaehee finally reaches the ultimate in-game achievement — only to suddenly find herself in the RPG gacha game Terrarium Adventure! Why was she pulled into the game, and how can she get out? For now, she has no choice but to explore!", "slug": "1691", "cover": "https://static.manta.net/2022-05-25/az/azEGUeDoYdhlJ5vD.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-06-21T05:58:33.826Z"}, "Collide": {"author": "Wann", "artist": "Wann", "description": "Joy suddenly becomes involved with a secret group of superpowered individuals due to a genetic trait. Joy's fate changes rapidly as she gets caught up in a war between the superpowered. Things grow complicated as a top-class superpower user named Moowon becomes dangerously attracted to Joy...", "slug": "1200", "cover": "https://static.manta.net/2021-02-19/5E/5ExZJidlEoFxLTHj.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-04-17T06:01:50.457Z"}, "Michelin Star": {"author": "Song", "artist": "Song", "description": "Aspiring chef Taehwan Ryu dreams of earning the first Michelin star in Korea, even turning down a job offer from a renowned restaurant in France. Meanwhile, Eunbi Park, the owner of La Petit Maison, a restaurant in Korea, is clueless to her restaurant’s waning quality. What will happen when Taehwan decides to intervene in La Petit Maison’s kitchen?", "slug": "1160", "cover": "https://static.manta.net/2021-02-19/c5/c5ULSiknepw7oXQT.jpg", "groups": {"1": "Manta Comics"}, "last_updated": "2022-06-21T07:37:08.499Z"}}